#pragma once

/*
#############################################################################################
# Blade and Soul (25) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: Editor_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
# Mentions: Ant.
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/


/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum Editor.TextureFactory.TextureCompressionSettings
/*enum TextureCompressionSettings
{
	TC_Default                                         = 0,
	TC_Normalmap                                       = 1,
	TC_Displacementmap                                 = 2,
	TC_NormalmapAlpha                                  = 3,

	TEXTUREGROUP_Effects                               = 13,
	TEXTUREGROUP_Skybox                                = 14,
	TEXTUREGROUP_UI                                    = 15,
	TEXTUREGROUP_LightAndShadowMap                     = 16,
	TEXTUREGROUP_RenderTarget                          = 17,
	TEXTUREGROUP_System                                = 18,
	TEXTUREGROUP_TerrainDiffuse                        = 19,
	TEXTUREGROUP_TerrainNormalMap                      = 20,
	TEXTUREGROUP_UniqueDiffuse                         = 21,
	TEXTUREGROUP_UniqueNormalMap                       = 22,
	TEXTUREGROUP_WorldMaskMap                          = 23,
	TEXTUREGROUP_WorldOcclusionMap                     = 24,
	TEXTUREGROUP_ColorLookupTable                      = 25,
	TEXTUREGROUP_MAX                                   = 26
};*/

// Enum Editor.TextureFactory.Blending
/*enum Blending
{
	BLEND_Opaque                                       = 0,
	BLEND_Masked                                       = 1,
	BLEND_Translucent                                  = 2,
	BLEND_Additive                                     = 3,
	BLEND_Modulate                                     = 4,
	BLEND_UI                                           = 5,
	BLEND_MAX                                          = 6
};*/

// Enum Editor.TextureFactory.LightingModel
/*enum LightingModel
{
	MLM_Phong                                          = 0,
	MLM_NonDirectional                                 = 1,
	MLM_Unlit                                          = 2,
	MLM_Custom                                         = 3,
	MLM_Anisotropic                                    = 4,
	MLM_MAX                                            = 5
};*/

// Enum Editor.RenderTargetCubeExporterTGA.CubeFace
/*enum CubeFace
{
	CubeFace_MAX                                       = 0
};*/

// Enum Editor.TextureMovieFactory.MovieStreamSource
/*enum MovieStreamSource
{
	MovieStream_File                                   = 0,
	MovieStream_Memory                                 = 1,
	MovieStream_MAX                                    = 2
};*/

// Enum Editor.TextureRenderTargetCubeFactoryNew.Format
/*enum Format
{
	A8R8G8B8                                           = 0,
	Format_MAX                                         = 1
};*/

// Enum Editor.TextureRenderTargetFactoryNew.Format
/*enum Format
{
	A8R8G8B8                                           = 0,
	Format_MAX                                         = 1
};*/

// Enum Editor.SheetBuilder.ESheetAxis
/*enum ESheetAxis
{
	AX_Horizontal                                      = 0,
	AX_XAxis                                           = 1,
	AX_YAxis                                           = 2,
	AX_MAX                                             = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class Editor.AnalyzeContentCommandlet
// 0x0000 (0x007C - 0x007C)
class UAnalyzeContentCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2682 ];

		return pClassPointer;
	};

};

//UClass* UAnalyzeContentCommandlet::pClassPointer = NULL;

// Class Editor.AnalyzeCookedContentCommandlet
// 0x0018 (0x0094 - 0x007C)
class UAnalyzeCookedContentCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x18 ];                            		// 0x007C (0x0018) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2684 ];

		return pClassPointer;
	};

};

//UClass* UAnalyzeCookedContentCommandlet::pClassPointer = NULL;

// Class Editor.AnalyzeCookedPackagesCommandlet
// 0x0000 (0x007C - 0x007C)
class UAnalyzeCookedPackagesCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2686 ];

		return pClassPointer;
	};

};

//UClass* UAnalyzeCookedPackagesCommandlet::pClassPointer = NULL;

// Class Editor.AnalyzeFallbackMaterialsCommandlet
// 0x003C (0x00B8 - 0x007C)
class UAnalyzeFallbackMaterialsCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x3C ];                            		// 0x007C (0x003C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2688 ];

		return pClassPointer;
	};

};

//UClass* UAnalyzeFallbackMaterialsCommandlet::pClassPointer = NULL;

// Class Editor.AnalyzeReferencedContentCommandlet
// 0x01B0 (0x022C - 0x007C)
class UAnalyzeReferencedContentCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x1B0 ];                           		// 0x007C (0x01B0) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2690 ];

		return pClassPointer;
	};

};

//UClass* UAnalyzeReferencedContentCommandlet::pClassPointer = NULL;

// Class Editor.AnalyzeScriptCommandlet
// 0x0000 (0x007C - 0x007C)
class UAnalyzeScriptCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2692 ];

		return pClassPointer;
	};

};

//UClass* UAnalyzeScriptCommandlet::pClassPointer = NULL;

// Class Editor.AnimSetFactoryNew
// 0x0000 (0x0070 - 0x0070)
class UAnimSetFactoryNew : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2694 ];

		return pClassPointer;
	};

};

//UClass* UAnimSetFactoryNew::pClassPointer = NULL;

// Class Editor.AnimTreeFactoryNew
// 0x0000 (0x0070 - 0x0070)
class UAnimTreeFactoryNew : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2696 ];

		return pClassPointer;
	};

};

//UClass* UAnimTreeFactoryNew::pClassPointer = NULL;

// Class Editor.BatchExportCommandlet
// 0x0000 (0x007C - 0x007C)
class UBatchExportCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2698 ];

		return pClassPointer;
	};

};

//UClass* UBatchExportCommandlet::pClassPointer = NULL;

// Class Editor.BrushBuilder
// 0x003C (0x0078 - 0x003C)
class UBrushBuilder : public UObject
{
public:
	struct FString                                     BitmapFilename;                                   		// 0x003C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     ToolTip;                                          		// 0x0048 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FVector >                           Vertices;                                         		// 0x0054 (0x000C) [0x0000000000000000]              
	TArray< struct FBuilderPoly >                      Polys;                                            		// 0x0060 (0x000C) [0x0000000000000000]              
	struct FName                                       Group;                                            		// 0x006C (0x0008) [0x0000000000000000]              
	unsigned long                                      MergeCoplanars : 1;                               		// 0x0074 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2700 ];

		return pClassPointer;
	};

	bool eventBuild ( );
	void PolyEnd ( );
	void Polyi ( int I );
	void PolyBegin ( int Direction, struct FName ItemName );
	void Poly4i ( int Direction, int I, int J, int K, int L, struct FName ItemName, unsigned long bIsTwoSidedNonSolid );
	void Poly3i ( int Direction, int I, int J, int K, struct FName ItemName, unsigned long bIsTwoSidedNonSolid );
	int Vertex3f ( float X, float Y, float Z );
	int Vertexv ( struct FVector V );
	bool BadParameters ( struct FString msg );
	int GetPolyCount ( );
	struct FVector GetVertex ( int I );
	int GetVertexCount ( );
	bool EndBrush ( );
	void BeginBrush ( unsigned long InMergeCoplanars, struct FName InGroup );
};

//UClass* UBrushBuilder::pClassPointer = NULL;

// Class Editor.BuildContentTagIndexCommandlet
// 0x0000 (0x007C - 0x007C)
class UBuildContentTagIndexCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2702 ];

		return pClassPointer;
	};

};

//UClass* UBuildContentTagIndexCommandlet::pClassPointer = NULL;

// Class Editor.CameraAnimFactory
// 0x0000 (0x0070 - 0x0070)
class UCameraAnimFactory : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2704 ];

		return pClassPointer;
	};

};

//UClass* UCameraAnimFactory::pClassPointer = NULL;

// Class Editor.ResavePackagesCommandlet
// 0x0050 (0x00CC - 0x007C)
class UResavePackagesCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x50 ];                            		// 0x007C (0x0050) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2706 ];

		return pClassPointer;
	};

};

//UClass* UResavePackagesCommandlet::pClassPointer = NULL;

// Class Editor.ChangePrefabSequenceClassCommandlet
// 0x0000 (0x00CC - 0x00CC)
class UChangePrefabSequenceClassCommandlet : public UResavePackagesCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2708 ];

		return pClassPointer;
	};

};

//UClass* UChangePrefabSequenceClassCommandlet::pClassPointer = NULL;

// Class Editor.CheckClassOffsetCommandlet
// 0x0000 (0x007C - 0x007C)
class UCheckClassOffsetCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2710 ];

		return pClassPointer;
	};

};

//UClass* UCheckClassOffsetCommandlet::pClassPointer = NULL;

// Class Editor.CheckFileDependencyCommandlet
// 0x0000 (0x007C - 0x007C)
class UCheckFileDependencyCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2712 ];

		return pClassPointer;
	};

};

//UClass* UCheckFileDependencyCommandlet::pClassPointer = NULL;

// Class Editor.ClassExporterUC
// 0x0000 (0x0064 - 0x0064)
class UClassExporterUC : public UExporter
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2714 ];

		return pClassPointer;
	};

};

//UClass* UClassExporterUC::pClassPointer = NULL;

// Class Editor.ClassFactoryUC
// 0x0000 (0x0070 - 0x0070)
class UClassFactoryUC : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2716 ];

		return pClassPointer;
	};

};

//UClass* UClassFactoryUC::pClassPointer = NULL;

// Class Editor.ColladaFactory
// 0x0004 (0x0074 - 0x0070)
class UColladaFactory : public UFactory
{
public:
	unsigned long                                      bImportAsSkeletalMesh : 1;                        		// 0x0070 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2718 ];

		return pClassPointer;
	};

};

//UClass* UColladaFactory::pClassPointer = NULL;

// Class Editor.ConfigComponent
// 0x0004 (0x004C - 0x0048)
class UConfigComponent : public UComponent
{
public:
	class UPostProcessParameter*                       PPParameter;                                      		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2721 ];

		return pClassPointer;
	};

};

//UClass* UConfigComponent::pClassPointer = NULL;

// Class Editor.ConformCommandlet
// 0x0000 (0x007C - 0x007C)
class UConformCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2723 ];

		return pClassPointer;
	};

};

//UClass* UConformCommandlet::pClassPointer = NULL;

// Class Editor.ContentTagIndex
// 0x001C (0x0058 - 0x003C)
class UContentTagIndex : public UObject
{
public:
	int                                                VersionInfo;                                      		// 0x003C (0x0004) [0x0000000000000002]              ( CPF_Const )
	TArray< struct FTagInfo >                          DefaultTags;                                      		// 0x0040 (0x000C) [0x0000000000004002]              ( CPF_Const | CPF_Config )
	TArray< struct FTagInfo >                          Tags;                                             		// 0x004C (0x000C) [0x0000000000000002]              ( CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2725 ];

		return pClassPointer;
	};

};

//UClass* UContentTagIndex::pClassPointer = NULL;

// Class Editor.CookPackagesCommandlet
// 0x0D84 (0x0E00 - 0x007C)
class UCookPackagesCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0xD84 ];                           		// 0x007C (0x0D84) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2727 ];

		return pClassPointer;
	};

};

//UClass* UCookPackagesCommandlet::pClassPointer = NULL;

// Class Editor.CreateCacheCollectiveCommandlet
// 0x0604 (0x0680 - 0x007C)
class UCreateCacheCollectiveCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x604 ];                           		// 0x007C (0x0604) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2729 ];

		return pClassPointer;
	};

};

//UClass* UCreateCacheCollectiveCommandlet::pClassPointer = NULL;

// Class Editor.CreateDefaultStyleCommandlet
// 0x0004 (0x0080 - 0x007C)
class UCreateDefaultStyleCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x007C (0x0004) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2731 ];

		return pClassPointer;
	};

};

//UClass* UCreateDefaultStyleCommandlet::pClassPointer = NULL;

// Class Editor.CubeBuilder
// 0x001C (0x0094 - 0x0078)
class UCubeBuilder : public UBrushBuilder
{
public:
	float                                              X;                                                		// 0x0078 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Y;                                                		// 0x007C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Z;                                                		// 0x0080 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              WallThickness;                                    		// 0x0084 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       GroupName;                                        		// 0x0088 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      Hollow : 1;                                       		// 0x0090 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      Tessellated : 1;                                  		// 0x0090 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2733 ];

		return pClassPointer;
	};

	bool eventBuild ( );
	void BuildCube ( int Direction, float DX, float DY, float dz, unsigned long _tessellated );
};

//UClass* UCubeBuilder::pClassPointer = NULL;

// Class Editor.CurveEdPresetCurveFactoryNew
// 0x0000 (0x0070 - 0x0070)
class UCurveEdPresetCurveFactoryNew : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2735 ];

		return pClassPointer;
	};

};

//UClass* UCurveEdPresetCurveFactoryNew::pClassPointer = NULL;

// Class Editor.CutDownContentCommandlet
// 0x0000 (0x007C - 0x007C)
class UCutDownContentCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2737 ];

		return pClassPointer;
	};

};

//UClass* UCutDownContentCommandlet::pClassPointer = NULL;

// Class Editor.DebugShaderCompileDataCommandlet
// 0x0004 (0x0080 - 0x007C)
class UDebugShaderCompileDataCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x007C (0x0004) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2739 ];

		return pClassPointer;
	};

};

//UClass* UDebugShaderCompileDataCommandlet::pClassPointer = NULL;

// Class Editor.DecalMaterialFactoryNew
// 0x0000 (0x0070 - 0x0070)
class UDecalMaterialFactoryNew : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2741 ];

		return pClassPointer;
	};

};

//UClass* UDecalMaterialFactoryNew::pClassPointer = NULL;

// Class Editor.DialogueSetFactory
// 0x0000 (0x0070 - 0x0070)
class UDialogueSetFactory : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2743 ];

		return pClassPointer;
	};

};

//UClass* UDialogueSetFactory::pClassPointer = NULL;

// Class Editor.DiffPackagesCommandlet
// 0x0018 (0x0094 - 0x007C)
class UDiffPackagesCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x18 ];                            		// 0x007C (0x0018) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2745 ];

		return pClassPointer;
	};

};

//UClass* UDiffPackagesCommandlet::pClassPointer = NULL;

// Class Editor.DistributionFloatConstantCurveFactory
// 0x0000 (0x0070 - 0x0070)
class UDistributionFloatConstantCurveFactory : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2747 ];

		return pClassPointer;
	};

};

//UClass* UDistributionFloatConstantCurveFactory::pClassPointer = NULL;

// Class Editor.DumpEmittersCommandlet
// 0x0000 (0x007C - 0x007C)
class UDumpEmittersCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2749 ];

		return pClassPointer;
	};

};

//UClass* UDumpEmittersCommandlet::pClassPointer = NULL;

// Class Editor.DumpLightmapInfoCommandlet
// 0x0000 (0x007C - 0x007C)
class UDumpLightmapInfoCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2751 ];

		return pClassPointer;
	};

};

//UClass* UDumpLightmapInfoCommandlet::pClassPointer = NULL;

// Class Editor.DumpShadersCommandlet
// 0x000C (0x0088 - 0x007C)
class UDumpShadersCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0xC ];                             		// 0x007C (0x000C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2753 ];

		return pClassPointer;
	};

};

//UClass* UDumpShadersCommandlet::pClassPointer = NULL;

// Class Editor.EditorComponent
// 0x001C (0x022C - 0x0210)
class UEditorComponent : public UPrimitiveComponent
{
public:
	unsigned long                                      bDrawGrid : 1;                                    		// 0x0210 (0x0004) [0x0000000000000002] [0x00000001] ( CPF_Const )
	unsigned long                                      bDrawPivot : 1;                                   		// 0x0210 (0x0004) [0x0000000000000002] [0x00000002] ( CPF_Const )
	unsigned long                                      bDrawBaseInfo : 1;                                		// 0x0210 (0x0004) [0x0000000000000002] [0x00000004] ( CPF_Const )
	unsigned long                                      bDrawWorldBox : 1;                                		// 0x0210 (0x0004) [0x0000000000000002] [0x00000008] ( CPF_Const )
	unsigned long                                      bDrawColoredOrigin : 1;                           		// 0x0210 (0x0004) [0x0000000000000002] [0x00000010] ( CPF_Const )
	unsigned long                                      bDrawKillZ : 1;                                   		// 0x0210 (0x0004) [0x0000000000000002] [0x00000020] ( CPF_Const )
	struct FColor                                      GridColorHi;                                      		// 0x0214 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FColor                                      GridColorLo;                                      		// 0x0218 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              PerspectiveGridSize;                              		// 0x021C (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FColor                                      PivotColor;                                       		// 0x0220 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              PivotSize;                                        		// 0x0224 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FColor                                      BaseBoxColor;                                     		// 0x0228 (0x0004) [0x0000000000000002]              ( CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2755 ];

		return pClassPointer;
	};

};

//UClass* UEditorComponent::pClassPointer = NULL;

// Class Editor.EditorEngine
// 0x01C0 (0x0734 - 0x0574)
class UEditorEngine : public UEngine
{
public:
	struct FPointer                                    VfTable_FCallbackEventDevice;                     		// 0x0574 (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	class UModel*                                      TempModel;                                        		// 0x0578 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UTransBuffer*                                Trans;                                            		// 0x057C (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UTextBuffer*                                 Results;                                          		// 0x0580 (0x0004) [0x0000000000000002]              ( CPF_Const )
	TArray< struct FPointer >                          ActorProperties;                                  		// 0x0584 (0x000C) [0x0000000000000002]              ( CPF_Const )
	struct FPointer                                    LevelProperties;                                  		// 0x0590 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UTexture2D*                                  Bad;                                              		// 0x0594 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UTexture2D*                                  Bkgnd;                                            		// 0x0598 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UTexture2D*                                  BkgndHi;                                          		// 0x059C (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UTexture2D*                                  BadHighlight;                                     		// 0x05A0 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UTexture2D*                                  MaterialArrow;                                    		// 0x05A4 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UTexture2D*                                  MaterialBackdrop;                                 		// 0x05A8 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class USoundCue*                                   PreviewSoundCue;                                  		// 0x05AC (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	class UAudioComponent*                             PreviewAudioComponent;                            		// 0x05B0 (0x0004) [0x000000000000200A]              ( CPF_Const | CPF_ExportObject | CPF_Transient )
	class UStaticMesh*                                 TexPropCube;                                      		// 0x05B4 (0x0004) [0x0000000000000000]              
	class UStaticMesh*                                 TexPropSphere;                                    		// 0x05B8 (0x0004) [0x0000000000000000]              
	class UStaticMesh*                                 TexPropPlane;                                     		// 0x05BC (0x0004) [0x0000000000000000]              
	class UStaticMesh*                                 TexPropCylinder;                                  		// 0x05C0 (0x0004) [0x0000000000000000]              
	unsigned long                                      bFastRebuild : 1;                                 		// 0x05C4 (0x0004) [0x0000000000000002] [0x00000001] ( CPF_Const )
	unsigned long                                      bBootstrapping : 1;                               		// 0x05C4 (0x0004) [0x0000000000000002] [0x00000002] ( CPF_Const )
	unsigned long                                      bIsImportingT3D : 1;                              		// 0x05C4 (0x0004) [0x0000000000000002] [0x00000004] ( CPF_Const )
	int                                                TerrainEditBrush;                                 		// 0x05C8 (0x0004) [0x0000000000000002]              ( CPF_Const )
	int                                                ClickFlags;                                       		// 0x05CC (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UPackage*                                    ParentContext;                                    		// 0x05D0 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FVector                                     ClickLocation;                                    		// 0x05D4 (0x000C) [0x0000000000000002]              ( CPF_Const )
	struct FPlane                                      ClickPlane;                                       		// 0x05E0 (0x0010) [0x0000000000000002]              ( CPF_Const )
	struct FVector                                     MouseMovement;                                    		// 0x05F0 (0x000C) [0x0000000000000002]              ( CPF_Const )
	TArray< struct FPointer >                          ViewportClients;                                  		// 0x05FC (0x000C) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	float                                              FarClippingPlane;                                 		// 0x0608 (0x0004) [0x0000000000000002]              ( CPF_Const )
	unsigned char                                      DetailMode;                                       		// 0x060C (0x0001) [0x0000000000000000]              
	struct FPointer                                    ConstraintsVtbl;                                  		// 0x0610 (0x0004) [0x0000000000000002]              ( CPF_Const )
	unsigned long                                      GridEnabled : 1;                                  		// 0x0614 (0x0004) [0x0000000000004001] [0x00000001] ( CPF_Edit | CPF_Config )
	unsigned long                                      SnapScaleEnabled : 1;                             		// 0x0614 (0x0004) [0x0000000000004001] [0x00000002] ( CPF_Edit | CPF_Config )
	unsigned long                                      SnapVertices : 1;                                 		// 0x0614 (0x0004) [0x0000000000004001] [0x00000004] ( CPF_Edit | CPF_Config )
	int                                                ScaleGridSize;                                    		// 0x0618 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              SnapDistance;                                     		// 0x061C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              GridSizes[ 0xB ];                                 		// 0x0620 (0x002C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	int                                                CurrentGridSz;                                    		// 0x064C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	unsigned long                                      RotGridEnabled : 1;                               		// 0x0650 (0x0004) [0x0000000000004001] [0x00000001] ( CPF_Edit | CPF_Config )
	struct FRotator                                    RotGridSize;                                      		// 0x0654 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	unsigned long                                      UseSizingBox : 1;                                 		// 0x0660 (0x0004) [0x0000000000004001] [0x00000001] ( CPF_Edit | CPF_Config )
	unsigned long                                      UseAxisIndicator : 1;                             		// 0x0660 (0x0004) [0x0000000000004001] [0x00000002] ( CPF_Edit | CPF_Config )
	float                                              FOVAngle;                                         		// 0x0664 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	unsigned long                                      GodMode : 1;                                      		// 0x0668 (0x0004) [0x0000000000004001] [0x00000001] ( CPF_Edit | CPF_Config )
	struct FString                                     AutoSaveDir;                                      		// 0x066C (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	unsigned long                                      InvertwidgetZAxis : 1;                            		// 0x0678 (0x0004) [0x0000000000004001] [0x00000001] ( CPF_Edit | CPF_Config )
	struct FString                                     GameCommandLine;                                  		// 0x067C (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	TArray< struct FString >                           EditPackages;                                     		// 0x0688 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FString                                     EditPackagesInPath;                               		// 0x0694 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FString                                     EditPackagesOutPath;                              		// 0x06A0 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FString                                     FRScriptOutputPath;                               		// 0x06AC (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	unsigned long                                      AlwaysShowTerrain : 1;                            		// 0x06B8 (0x0004) [0x0000000000004001] [0x00000001] ( CPF_Edit | CPF_Config )
	unsigned long                                      UseActorRotationGizmo : 1;                        		// 0x06B8 (0x0004) [0x0000000000004001] [0x00000002] ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowBrushMarkerPolys : 1;                        		// 0x06B8 (0x0004) [0x0000000000004001] [0x00000004] ( CPF_Edit | CPF_Config )
	unsigned long                                      bUseMayaCameraControls : 1;                       		// 0x06B8 (0x0004) [0x0000000000004001] [0x00000008] ( CPF_Edit | CPF_Config )
	unsigned long                                      bPrefabsLocked : 1;                               		// 0x06B8 (0x0004) [0x0000000000004001] [0x00000010] ( CPF_Edit | CPF_Config )
	unsigned long                                      bEnableSocketSnapping : 1;                        		// 0x06B8 (0x0004) [0x0000000000004001] [0x00000020] ( CPF_Edit | CPF_Config )
	struct FString                                     HeightMapExportClassName;                         		// 0x06BC (0x000C) [0x0000000000004000]              ( CPF_Config )
	TArray< class UActorFactory* >                     ActorFactories;                                   		// 0x06C8 (0x000C) [0x0000000000000002]              ( CPF_Const )
	struct FString                                     UserOpenedFile;                                   		// 0x06D4 (0x000C) [0x0000000000000000]              
	struct FString                                     InEditorGameURLOptions;                           		// 0x06E0 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	class UWorld*                                      PlayWorld;                                        		// 0x06EC (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FVector                                     PlayWorldLocation;                                		// 0x06F0 (0x000C) [0x0000000000000002]              ( CPF_Const )
	struct FRotator                                    PlayWorldRotation;                                		// 0x06FC (0x000C) [0x0000000000000002]              ( CPF_Const )
	unsigned long                                      bIsPlayWorldQueued : 1;                           		// 0x0708 (0x0004) [0x0000000000000002] [0x00000001] ( CPF_Const )
	unsigned long                                      bHasPlayWorldPlacement : 1;                       		// 0x0708 (0x0004) [0x0000000000000002] [0x00000002] ( CPF_Const )
	unsigned long                                      bWorldPackageWasDirty : 1;                        		// 0x0708 (0x0004) [0x0000000000000002] [0x00000004] ( CPF_Const )
	int                                                PlayWorldDestination;                             		// 0x070C (0x0004) [0x0000000000000002]              ( CPF_Const )
	int                                                PlayInEditorViewportIndex;                        		// 0x0710 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FPointer                                    InEditorPropagator;                               		// 0x0714 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FPointer                                    RemotePropagator;                                 		// 0x0718 (0x0004) [0x0000000000000002]              ( CPF_Const )
	unsigned long                                      bIsPushingView : 1;                               		// 0x071C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bColorPickModeEnabled : 1;                        		// 0x071C (0x0004) [0x0000000000002002] [0x00000002] ( CPF_Const | CPF_Transient )
	unsigned long                                      bDecalUpdateRequested : 1;                        		// 0x071C (0x0004) [0x0000000000002002] [0x00000004] ( CPF_Const | CPF_Transient )
	class UTextureRenderTarget2D*                      ScratchRenderTarget;                              		// 0x0720 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	class UTexture2D*                                  StreamingBoundsTexture;                           		// 0x0724 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	class UEditorUserSettings*                         UserSettings;                                     		// 0x0728 (0x0004) [0x0000000000000002]              ( CPF_Const )
	int                                                BSPViewModeIndex;                                 		// 0x072C (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FPointer                                    AutoZoneBuilder;                                  		// 0x0730 (0x0004) [0x0000000000000002]              ( CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2757 ];

		return pClassPointer;
	};

};

//UClass* UEditorEngine::pClassPointer = NULL;

// Class Editor.EditorPlayer
// 0x0003 (0x0534 - 0x0531)
class UEditorPlayer : public ULocalPlayer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2759 ];

		return pClassPointer;
	};

};

//UClass* UEditorPlayer::pClassPointer = NULL;

// Class Editor.EditorUserSettings
// 0x0004 (0x0040 - 0x003C)
class UEditorUserSettings : public UObject
{
public:
	unsigned long                                      AllowFlightCameraToRemapKeys : 1;                 		// 0x003C (0x0004) [0x0000000000004001] [0x00000001] ( CPF_Edit | CPF_Config )
	unsigned long                                      bAllowSelectTranslucent : 1;                      		// 0x003C (0x0004) [0x0000000000004001] [0x00000002] ( CPF_Edit | CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2761 ];

		return pClassPointer;
	};

};

//UClass* UEditorUserSettings::pClassPointer = NULL;

// Class Editor.EditorViewportInput
// 0x0004 (0x012C - 0x0128)
class UEditorViewportInput : public UInput
{
public:
	class UEditorEngine*                               Editor;                                           		// 0x0128 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2763 ];

		return pClassPointer;
	};

};

//UClass* UEditorViewportInput::pClassPointer = NULL;

// Class Editor.EdModeComponent
// 0x0000 (0x022C - 0x022C)
class UEdModeComponent : public UEditorComponent
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2765 ];

		return pClassPointer;
	};

};

//UClass* UEdModeComponent::pClassPointer = NULL;

// Class Editor.EventJumpTemplateFactory
// 0x0000 (0x0070 - 0x0070)
class UEventJumpTemplateFactory : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2767 ];

		return pClassPointer;
	};

};

//UClass* UEventJumpTemplateFactory::pClassPointer = NULL;

// Class Editor.ExamineOutersCommandlet
// 0x0000 (0x007C - 0x007C)
class UExamineOutersCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2769 ];

		return pClassPointer;
	};

};

//UClass* UExamineOutersCommandlet::pClassPointer = NULL;

// Class Editor.ExportLocCommandlet
// 0x0000 (0x007C - 0x007C)
class UExportLocCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2771 ];

		return pClassPointer;
	};

};

//UClass* UExportLocCommandlet::pClassPointer = NULL;

// Class Editor.FindDuplicateKismetObjectsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFindDuplicateKismetObjectsCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2773 ];

		return pClassPointer;
	};

};

//UClass* UFindDuplicateKismetObjectsCommandlet::pClassPointer = NULL;

// Class Editor.FindEmitterMismatchedLODsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFindEmitterMismatchedLODsCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2775 ];

		return pClassPointer;
	};

};

//UClass* UFindEmitterMismatchedLODsCommandlet::pClassPointer = NULL;

// Class Editor.FindEmitterModifiedLODsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFindEmitterModifiedLODsCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2777 ];

		return pClassPointer;
	};

};

//UClass* UFindEmitterModifiedLODsCommandlet::pClassPointer = NULL;

// Class Editor.FindEmitterModuleLODErrorsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFindEmitterModuleLODErrorsCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2779 ];

		return pClassPointer;
	};

};

//UClass* UFindEmitterModuleLODErrorsCommandlet::pClassPointer = NULL;

// Class Editor.FindQuestionableTexturesCommandlet
// 0x0000 (0x007C - 0x007C)
class UFindQuestionableTexturesCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2781 ];

		return pClassPointer;
	};

};

//UClass* UFindQuestionableTexturesCommandlet::pClassPointer = NULL;

// Class Editor.PerformMapCheckCommandlet
// 0x0018 (0x0094 - 0x007C)
class UPerformMapCheckCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x18 ];                            		// 0x007C (0x0018) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2783 ];

		return pClassPointer;
	};

};

//UClass* UPerformMapCheckCommandlet::pClassPointer = NULL;

// Class Editor.FindRenamedPrefabSequencesCommandlet
// 0x0048 (0x00DC - 0x0094)
class UFindRenamedPrefabSequencesCommandlet : public UPerformMapCheckCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x48 ];                            		// 0x0094 (0x0048) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2785 ];

		return pClassPointer;
	};

};

//UClass* UFindRenamedPrefabSequencesCommandlet::pClassPointer = NULL;

// Class Editor.FindSoundCuesWithMissingGroupsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFindSoundCuesWithMissingGroupsCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2787 ];

		return pClassPointer;
	};

};

//UClass* UFindSoundCuesWithMissingGroupsCommandlet::pClassPointer = NULL;

// Class Editor.FindStaticActorsRefsCommandlet
// 0x00A0 (0x0134 - 0x0094)
class UFindStaticActorsRefsCommandlet : public UPerformMapCheckCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0xA0 ];                            		// 0x0094 (0x00A0) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2789 ];

		return pClassPointer;
	};

};

//UClass* UFindStaticActorsRefsCommandlet::pClassPointer = NULL;

// Class Editor.FindTexturesWithMissingPhysicalMaterialsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFindTexturesWithMissingPhysicalMaterialsCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2791 ];

		return pClassPointer;
	};

};

//UClass* UFindTexturesWithMissingPhysicalMaterialsCommandlet::pClassPointer = NULL;

// Class Editor.FixAmbiguousMaterialParametersCommandlet
// 0x0000 (0x007C - 0x007C)
class UFixAmbiguousMaterialParametersCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2793 ];

		return pClassPointer;
	};

};

//UClass* UFixAmbiguousMaterialParametersCommandlet::pClassPointer = NULL;

// Class Editor.FixupEmittersCommandlet
// 0x0000 (0x007C - 0x007C)
class UFixupEmittersCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2795 ];

		return pClassPointer;
	};

};

//UClass* UFixupEmittersCommandlet::pClassPointer = NULL;

// Class Editor.FixupRedirectsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFixupRedirectsCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2797 ];

		return pClassPointer;
	};

};

//UClass* UFixupRedirectsCommandlet::pClassPointer = NULL;

// Class Editor.FixupSourceUVsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFixupSourceUVsCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2799 ];

		return pClassPointer;
	};

};

//UClass* UFixupSourceUVsCommandlet::pClassPointer = NULL;

// Class Editor.FonixFactory
// 0x0000 (0x0070 - 0x0070)
class UFonixFactory : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2801 ];

		return pClassPointer;
	};

};

//UClass* UFonixFactory::pClassPointer = NULL;

// Class Editor.FontAttributeFactory
// 0x0000 (0x0070 - 0x0070)
class UFontAttributeFactory : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2803 ];

		return pClassPointer;
	};

};

//UClass* UFontAttributeFactory::pClassPointer = NULL;

// Class Editor.FontColorFactory
// 0x0000 (0x0070 - 0x0070)
class UFontColorFactory : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2805 ];

		return pClassPointer;
	};

};

//UClass* UFontColorFactory::pClassPointer = NULL;

// Class Editor.FontFaceFactory
// 0x0000 (0x0070 - 0x0070)
class UFontFaceFactory : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2807 ];

		return pClassPointer;
	};

};

//UClass* UFontFaceFactory::pClassPointer = NULL;

// Class Editor.TextureFactory
// 0x004C (0x00BC - 0x0070)
class UTextureFactory : public UFactory
{
public:
	unsigned long                                      NoCompression : 1;                                		// 0x0070 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      CompressionNoAlpha : 1;                           		// 0x0074 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      DeferCompression : 1;                             		// 0x0078 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      CompressionSettings;                              		// 0x007C (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      Create_Material_ : 1;                             		// 0x0080 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      RGB_To_Diffuse : 1;                               		// 0x0084 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      RGB_To_Emissive : 1;                              		// 0x0088 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      Alpha_To_Specular : 1;                            		// 0x008C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      Alpha_To_Emissive : 1;                            		// 0x0090 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      Alpha_To_Opacity : 1;                             		// 0x0094 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      Alpha_To_Opacity_Mask : 1;                        		// 0x0098 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      Two_Sided_ : 1;                                   		// 0x009C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      Blending;                                         		// 0x00A0 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Lighting_Model;                                   		// 0x00A1 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      LODGroup;                                         		// 0x00A2 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      FlipBook : 1;                                     		// 0x00A4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      Dither_Mip_maps_alpha_ : 1;                       		// 0x00A8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      Preserve_border_R : 1;                            		// 0x00AC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      Preserve_border_G : 1;                            		// 0x00B0 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      Preserve_border_B : 1;                            		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      Preserve_border_A : 1;                            		// 0x00B8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2809 ];

		return pClassPointer;
	};

};

//UClass* UTextureFactory::pClassPointer = NULL;

// Class Editor.FontFactory
// 0x0000 (0x00BC - 0x00BC)
class UFontFactory : public UTextureFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2836 ];

		return pClassPointer;
	};

};

//UClass* UFontFactory::pClassPointer = NULL;

// Class Editor.FontResourceFactory
// 0x0000 (0x0070 - 0x0070)
class UFontResourceFactory : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2838 ];

		return pClassPointer;
	};

};

//UClass* UFontResourceFactory::pClassPointer = NULL;

// Class Editor.FontSetFactory
// 0x0000 (0x0070 - 0x0070)
class UFontSetFactory : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2840 ];

		return pClassPointer;
	};

};

//UClass* UFontSetFactory::pClassPointer = NULL;

// Class Editor.GeomModifier
// 0x0010 (0x004C - 0x003C)
class UGeomModifier : public UObject
{
public:
	struct FString                                     Description;                                      		// 0x003C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bPushButton : 1;                                  		// 0x0048 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bInitialized : 1;                                 		// 0x0048 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2842 ];

		return pClassPointer;
	};

};

//UClass* UGeomModifier::pClassPointer = NULL;

// Class Editor.GeomModifier_Edit
// 0x0000 (0x004C - 0x004C)
class UGeomModifier_Edit : public UGeomModifier
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2844 ];

		return pClassPointer;
	};

};

//UClass* UGeomModifier_Edit::pClassPointer = NULL;

// Class Editor.GeomModifier_AutoFix
// 0x0000 (0x004C - 0x004C)
class UGeomModifier_AutoFix : public UGeomModifier_Edit
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2846 ];

		return pClassPointer;
	};

};

//UClass* UGeomModifier_AutoFix::pClassPointer = NULL;

// Class Editor.GeomModifier_Clip
// 0x0004 (0x0050 - 0x004C)
class UGeomModifier_Clip : public UGeomModifier_Edit
{
public:
	unsigned long                                      bFlipNormal : 1;                                  		// 0x004C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bSplit : 1;                                       		// 0x004C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2848 ];

		return pClassPointer;
	};

};

//UClass* UGeomModifier_Clip::pClassPointer = NULL;

// Class Editor.GeomModifier_Create
// 0x0000 (0x004C - 0x004C)
class UGeomModifier_Create : public UGeomModifier_Edit
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2850 ];

		return pClassPointer;
	};

};

//UClass* UGeomModifier_Create::pClassPointer = NULL;

// Class Editor.GeomModifier_Delete
// 0x0000 (0x004C - 0x004C)
class UGeomModifier_Delete : public UGeomModifier_Edit
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2852 ];

		return pClassPointer;
	};

};

//UClass* UGeomModifier_Delete::pClassPointer = NULL;

