#pragma once

/*
#############################################################################################
# Blade and Soul (25) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: Engine_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
# Mentions: Ant.
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_TRACEFLAG_Bullet                                   1
#define CONST_TRACEFLAG_PhysicsVolumes                           2
#define CONST_TRACEFLAG_SkipMovers                               4
#define CONST_TRACEFLAG_Blocking                                 8
#define CONST_REP_RBLOCATION_ERROR_TOLERANCE_SQ                  16.0f
#define CONST_MINFLOORZ                                          0.7
#define CONST_ACTORMAXSTEPHEIGHT                                 35.0
#define CONST_RBSTATE_LINVELSCALE                                10.0

	UIACTION_EDITRESULT_FAIL_BIND_ALREADYBOUND         = 13,
	UIACTION_EDITRESULT_FAIL_ETC                       = 14,
	UIACTION_EDITRESULT_MAX                            = 15
};*/

// Enum Engine.UIActionEditNode.EUIActionTimeSyncType
/*enum EUIActionTimeSyncType
{
	UIACTION_TIMESYNCTYPE_NONE                         = 0,
	UIACTION_TIMESYNCTYPE_STARTTIME                    = 1,
	UIACTION_TIMESYNCTYPE_ENDTIME                      = 2,
	UIACTION_TIMESYNCTYPE_MAX                          = 3
};*/

// Enum Engine.UICalloutButtonPanel.ECalloutButtonLayoutType
/*enum ECalloutButtonLayoutType
{
	CBLT_None                                          = 0,
	CBLT_DockLeft                                      = 1,
	CBLT_DockRight                                     = 2,
	CBLT_MAX                                           = 3
};*/

// Enum Engine.UICond_IsFocused.ECondIsFocusedResultIndex
/*enum ECondIsFocusedResultIndex
{
	ISFOCUSEDRESULT_True                               = 0,
	ISFOCUSEDRESULT_False                              = 1,
	ISFOCUSEDRESULT_MAX                                = 2
};*/

// Enum Engine.UIDataProvider.EProviderAccessType
/*enum EProviderAccessType
{
	ACCESS_ReadOnly                                    = 0,
	ACCESS_PerField                                    = 1,
	ACCESS_WriteAll                                    = 2,
	ACCESS_MAX                                         = 3
};*/

// Enum Engine.UISafeRegionPanel.ESafeRegionType
/*enum ESafeRegionType
{
	ESRT_FullRegion                                    = 0,
	ESRT_TextSafeRegion                                = 1,
	ESRT_MAX                                           = 2
};*/

// Enum Engine.UIState.EUIStateType
/*enum EUIStateType
{
	UISTATE_TYPE_NONE                                  = 0,
	UISTATE_TYPE_ACTIVE                                = 1,
	UISTATE_TYPE_DISABLED                              = 2,
	UISTATE_TYPE_ENABLED                               = 3,
	UISTATE_TYPE_FOCUSED                               = 4,
	UISTATE_TYPE_PRESSED                               = 5,
	UISTATE_TYPE_MAX                                   = 6
};*/

// Enum Engine.Weapon.EWeaponFireType
/*enum EWeaponFireType
{
	EWFT_InstantHit                                    = 0,
	EWFT_Projectile                                    = 1,
	EWFT_Custom                                        = 2,
	EWFT_None                                          = 3,
	EWFT_MAX                                           = 4
};*/

// Enum Engine.WindDirectionalSourceComponent.EWindType
/*enum EWindType
{
	Point                                              = 0,
	Direction                                          = 1,
	Road                                               = 2,
	EWindType_MAX                                      = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class Engine.UIRoot
// 0x0000 (0x003C - 0x003C)
class UUIRoot : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 140 ];

		return pClassPointer;
	};

	class UOnlinePlayerInterfaceEx* GetOnlinePlayerInterfaceEx ( );
	class UOnlinePlayerInterface* GetOnlinePlayerInterface ( );
	class UOnlineGameInterface* GetOnlineGameInterface ( );
	struct FString ConvertWidgetIDToString ( class UUIObject* SourceWidget );
	bool GetDataStoreStringValue ( struct FString InDataStoreMarkup, class UUIScene* OwnerScene, class ULocalPlayer* OwnerPlayer, struct FString* OutStringValue );
	bool GetDataStoreFieldValue ( struct FString InDataStoreMarkup, class UUIScene* OwnerScene, class ULocalPlayer* OwnerPlayer, struct FUIProviderFieldValue* OutFieldValue );
	bool SetDataStoreStringValue ( struct FString InDataStoreMarkup, struct FString InStringValue, class UUIScene* OwnerScene, class ULocalPlayer* OwnerPlayer );
	bool SetDataStoreFieldValue ( struct FString InDataStoreMarkup, class UUIScene* OwnerScene, class ULocalPlayer* OwnerPlayer, struct FUIProviderFieldValue* InFieldValue );
	class UUIDataStore* StaticResolveDataStore ( struct FName DataStoreTag, class UUIScene* OwnerScene, class ULocalPlayer* InPlayerOwner );
	struct FMatrix GetPrimitiveTransform ( class UUIObject* Widget, unsigned long bIncludeAnchorPosition, unsigned long bIncudeRotation, unsigned long bIncludeScale );
	void SetMouseCaptureOverride ( unsigned long bCaptureMouse );
	bool GetCursorSize ( float* CursorXL, float* CursorYL );
	bool GetCursorPosition ( class UUIScene* Scene, int* CursorX, int* CursorY );
	unsigned char GetFaceOrientation ( unsigned char Face );
	class UGameUISceneClient* GetSceneClient ( );
	class UUIInteraction* GetCurrentUIController ( );
	bool IsConsole ( unsigned char ConsoleType );
	unsigned char GetInputPlatformType ( class ULocalPlayer* OwningPlayer );
};

//UClass* UUIRoot::pClassPointer = NULL;

// Class Engine.UIScreenObject
// 0x006C (0x00A8 - 0x003C)
class UUIScreenObject : public UUIRoot
{
public:
	struct FUIScreenValue_Bounds                       Position;                                         		// 0x003C (0x0024) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bHidden : 1;                                      		// 0x0060 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bInitialized : 1;                                 		// 0x0060 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      bNeverFocus : 1;                                  		// 0x0060 (0x0004) [0x0000000000000002] [0x00000004] ( CPF_Const )
	unsigned long                                      bSupportsFocusHint : 1;                           		// 0x0060 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bOverrideInputOrder : 1;                          		// 0x0060 (0x0004) [0x0000000000000002] [0x00000010] ( CPF_Const )
	unsigned long                                      bSupports3DPrimitives : 1;                        		// 0x0060 (0x0004) [0x0000000000000002] [0x00000020] ( CPF_Const )
	TArray< class UUIObject* >                         Children;                                         		// 0x0064 (0x000C) [0x0000000000000000]              
	TArray< class UClass* >                            DefaultStates;                                    		// 0x0070 (0x000C) [0x0000000000000002]              ( CPF_Const )
	class UClass*                                      InitialState;                                     		// 0x007C (0x0004) [0x0000000000000000]              
	TArray< class UUIState* >                          InactiveStates;                                   		// 0x0080 (0x000C) [0x000000000000000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject )
	TArray< class UUIState* >                          StateStack;                                       		// 0x008C (0x000C) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	unsigned char                                      PlayerInputMask;                                  		// 0x0098 (0x0001) [0x0000000000000000]              
	int                                                InstanceId;                                       		// 0x009C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                InstanceGroupId;                                  		// 0x00A0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UUIComp_Event*                               EventProvider;                                    		// 0x00A4 (0x0004) [0x0000000000000008]              ( CPF_ExportObject )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 139 ];

		return pClassPointer;
	};

	void LogCurrentState ( int Indent );
	unsigned char GetNATType ( );
	bool CanPlayOnline ( int ControllerId );
	bool HasLinkConnection ( );
	unsigned char GetLoginStatus ( int ControllerId );
	int GetBestControllerId ( );
	bool DisableWidget ( int PlayerIndex );
	bool EnableWidget ( int PlayerIndex );
	class UUIScreenObject* GetParent ( );
	bool eventActivateFocusHint ( class UUIObject* FocusHintObject );
	void eventGetSupportedUIActionKeyNames ( TArray< struct FName >* out_KeyNames );
	void eventSetInputMask ( unsigned char NewInputMask, unsigned long bRecurse );
	void eventDisablePlayerInput ( unsigned char PlayerIndex, unsigned long bRecurse );
	void eventEnablePlayerInput ( unsigned char PlayerIndex, unsigned long bRecurse );
	void eventSetVisibility ( unsigned long bIsVisible );
	void PrivateSetVisibility ( unsigned long bVisible );
	bool eventIsGamepadConnected ( int ControllerId );
	bool eventIsLoggedIn ( int ControllerId, unsigned long bRequireOnlineLogin );
	void eventRemovedFromParent ( class UUIScreenObject* WidgetOwner );
	void eventRemovedChild ( class UUIScreenObject* WidgetOwner, class UUIObject* OldChild, TArray< class UUIObject* > ExclusionSet );
	void eventAddedChild ( class UUIScreenObject* WidgetOwner, class UUIObject* NewChild );
	void eventPostInitialize ( );
	void eventInitialized ( );
	struct FString GetWidgetPathName ( );
	bool IsEnableActiveOnly ( );
	float GetAspectRatioAutoScaleFactor ( class UFont* BaseFont );
	struct FMatrix GetInverseCanvasToScreen ( );
	struct FMatrix GetCanvasToScreen ( );
	struct FVector PixelToCanvas ( struct FVector2D* PixelPosition );
	struct FVector ScreenToCanvas ( struct FVector4* ScreenPosition );
	struct FVector4 PixelToScreen ( struct FVector2D* PixelPosition );
	struct FVector2D ScreenToPixel ( struct FVector4* ScreenPosition );
	struct FVector4 CanvasToScreen ( struct FVector* CanvasPosition );
	struct FVector DeProject ( struct FVector* PixelPosition );
	struct FVector Project ( struct FVector* CanvasPosition );
	void GetDockedWidgets ( unsigned char SourceFace, unsigned char TargetFace, TArray< class UUIObject* >* out_DockedWidgets );
	float ResolveUIExtent ( class UUIScreenObject* OwnerWidget, unsigned char OutputType, struct FUIScreenValue_Extent* ExtentToResolve );
	struct FVector GetPositionVector ( unsigned long bIncludeParentPosition );
	float GetBounds ( unsigned char Dimension, unsigned char OutputType, unsigned long bIgnoreDockPadding );
	float GetPosition ( unsigned char Face, unsigned char OutputType, unsigned long bIncludeOrigin, unsigned long bIgnoreDockPadding );
	void SetPosition ( float NewValue, unsigned char Face, unsigned char InputType, unsigned long bIncludesViewportOrigin );
	int GetBestPlayerIndex ( );
	int GetSupportedPlayerCount ( );
	int GetActivePlayerCount ( );
	bool AcceptsPlayerInput ( int PlayerIndex );
	bool IsPressed ( int PlayerIndex );
	bool IsActive ( int PlayerIndex );
	bool IsFocused ( int PlayerIndex );
	bool IsEnabled ( int PlayerIndex, unsigned long bCheckOwnerChain );
	bool KillFocusEx ( int PlayerIndex );
	bool SetFocusEx ( int PlayerIndex );
	bool KillFocus ( class UUIScreenObject* Sender, int PlayerIndex );
	bool SetFocusToChild ( class UUIObject* ChildToFocus, int PlayerIndex );
	bool SetFocus ( class UUIScreenObject* Sender, int PlayerIndex );
	bool CanAcceptFocus ( int PlayerIndex );
	bool IsNeverFocused ( );
	bool IsHoldingShift ( int ControllerId );
	bool IsHoldingAlt ( int ControllerId );
	bool IsHoldingCtrl ( int ControllerId );
	bool ConditionalPropagateEnabledState ( int PlayerIndex, unsigned long bForce );
	bool DeactivateStateByClass ( class UClass* StateToRemove, int PlayerIndex, class UUIState** StateThatWasRemoved );
	bool DeactivateState ( class UUIState* StateToRemove, int PlayerIndex );
	bool ActivateStateByClass ( class UClass* StateToActivate, int PlayerIndex, class UUIState** StateThatWasAdded );
	bool ActivateState ( class UUIState* StateToActivate, int PlayerIndex );
	bool HasActiveStateOfClass ( class UClass* StateClass, int PlayerIndex, int* StateIndex );
	class UUIState* GetCurrentState ( int PlayerIndex );
	bool SetEnabled ( unsigned long bEnabled, int PlayerIndex );
	void FindEventsOfClass ( class UClass* EventClassToFind, class UUIState* LimitScope, unsigned long bExactClass, TArray< class UUIEvent* >* out_EventInstances );
	void ActivateEventByClass ( int PlayerIndex, class UClass* EventClassToActivate, class UObject* InEventActivator, unsigned long bActivateImmediately, TArray< int > IndicesToActivate, TArray< class UUIEvent* >* out_ActivatedEvents );
	float GetViewportHeight ( );
	float GetViewportWidth ( );
	bool GetViewportSize ( struct FVector2D* out_ViewportSize );
	bool GetViewportOrigin ( struct FVector2D* out_ViewportOrigin );
	float GetViewportScale ( );
	bool GetViewportOffset ( struct FVector2D* out_ViewportOffset );
	void RequestPrimitiveReview ( unsigned long bReinitializePrimitives, unsigned long bReviewPrimitiveUsage );
	void RequestFormattingUpdate ( );
	void RequestSceneUpdate ( unsigned long bDockingStackChanged, unsigned long bPositionsChanged, unsigned long bNavLinksOutdated, unsigned long bWidgetStylesChanged );
	int GetObjectCount ( );
	TArray< class UUIObject* > GetChildren ( unsigned long bRecurse, TArray< class UUIObject* > ExclusionSet );
	bool ContainsChildOfClass ( class UClass* SearchClass, unsigned long bRecurse );
	bool ContainsChild ( class UUIObject* Child, unsigned long bRecurse );
	int FindChildIndex ( struct FName WidgetName );
	class UUIObject* FindChildUsingID ( struct FWIDGET_ID WidgetID, unsigned long bRecurse );
	class UUIObject* FindChild ( struct FName WidgetName, unsigned long bRecurse );
	bool ReplaceChild ( class UUIObject* ExistingChild, class UUIObject* NewChild );
	bool ReparentChildren ( TArray< class UUIObject* > ChildrenToReparent, class UUIScreenObject* NewParent, int InsertIndex );
	bool ReparentChild ( class UUIObject* CurrentChild, class UUIScreenObject* NewParent, int InsertIndex );
	TArray< class UUIObject* > RemoveChildren ( TArray< class UUIObject* > ChildrenToRemove );
	bool RemoveChild ( class UUIObject* ExistingChild, TArray< class UUIObject* > ExclusionSet );
	int InsertChild ( class UUIObject* NewChild, int InsertIndex, unsigned long bRenameExisting );
	void Initialize ( class UUIScene* inOwnerScene, class UUIObject* InOwner );
	class UUIObject* CreateWidget ( class UUIScreenObject* Owner, class UClass* WidgetClass, class UObject* WidgetArchetype, struct FName WidgetName );
	bool PlayUISound ( struct FName SoundCueName, int PlayerIndex );
	class ULocalPlayer* GetPlayerOwner ( int PlayerIndex );
	void InitializePlayerTracking ( );
	void RemovePlayerData ( int PlayerIndex, class ULocalPlayer* RemovedPlayer );
	void CreatePlayerData ( int PlayerIndex, class ULocalPlayer* AddedPlayer );
	bool IsHidden ( unsigned long bIncludeParents );
	bool IsVisible ( unsigned long bIncludeParents );
	bool IsInitialized ( );
};

//UClass* UUIScreenObject::pClassPointer = NULL;

// Class Engine.UIObject
// 0x00B8 (0x0160 - 0x00A8)
class UUIObject : public UUIScreenObject
{
public:
	struct FWIDGET_ID                                  WidgetID;                                         		// 0x00A8 (0x0010) [0x0000000000000000]              
	struct FName                                       WidgetTag;                                        		// 0x00B8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UUIObject*                                   Owner;                                            		// 0x00C0 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UUIScene*                                    OwnerScene;                                       		// 0x00C4 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FUIStyleReference                           PrimaryStyle;                                     		// 0x00C8 (0x0020) [0x0000000000000000]              
	int                                                TabIndex;                                         		// 0x00E8 (0x0004) [0x0000000000000000]              
	struct FUIDockingSet                               DockTargets;                                      		// 0x00EC (0x0038) [0x0000000000000001]              ( CPF_Edit )
	float                                              RenderBounds[ 0x4 ];                              		// 0x0124 (0x0010) [0x0000000000002003]              ( CPF_Edit | CPF_Const | CPF_Transient )
	int                                                PrivateFlags;                                     		// 0x0134 (0x0004) [0x0000000000000000]              
	unsigned long                                      IsFirstCreateWidget : 1;                          		// 0x0138 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bEnableActiveCursorUpdates : 1;                   		// 0x0138 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bSupportsPrimaryStyle : 1;                        		// 0x0138 (0x0004) [0x0000000000000002] [0x00000004] ( CPF_Const )
	unsigned long                                      bEnableSceneUpdateNotifications : 1;              		// 0x0138 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bDebugShowBounds : 1;                             		// 0x0138 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      bHidePlaceWidget : 1;                             		// 0x0138 (0x0004) [0x0000000000000000] [0x00000020] 
	TArray< class UUIStyleResolver* >                  StyleSubscribers;                                 		// 0x013C (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FColor                                      DebugBoundsColor;                                 		// 0x0148 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fActivateTime;                                    		// 0x014C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fActivateTimeLeft;                                		// 0x0150 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FVector2D                                   ActivateTimeMousePos;                             		// 0x0154 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	int                                                ChildSceneIndex;                                  		// 0x015C (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 138 ];

		return pClassPointer;
	};

	void LogRenderBounds ( int Indent );
	void ClearDockTargets ( );
	class UUIScreenObject* GetParent ( );
	class UUIObject* GetOwner ( );
	class UUIScene* GetScene ( );
	bool SetWidgetStyleByName ( struct FName StyleResolverTagToSet, struct FName StyleFriendlyName );
	int FindStyleSubscriberIndexById ( struct FName StyleSubscriberId );
	int FindStyleSubscriberIndex ( class UUIStyleResolver** Subscriber );
	void RemoveStyleSubscriber ( class UUIStyleResolver* Subscriber );
	void AddStyleSubscriber ( class UUIStyleResolver* Subscriber );
	float GetPositionExtent ( unsigned char Face, unsigned long bIncludeRotation, unsigned long bIncludeOrigin );
	void GetPositionExtents ( unsigned long bIncludeRotation, unsigned long bIncludeOrigin, float* MinX, float* MaxX, float* MinY, float* MaxY );
	bool NeedsActiveCursorUpdates ( );
	void SetActiveCursorUpdate ( unsigned long bShouldReceiveCursorUpdates );
	void SetPrivateBehavior ( int Behavior, unsigned long Value, unsigned long bRecurse );
	bool IsPrivateBehaviorSet ( int Behavior );
	bool CanAcceptFocus ( int PlayerIndex );
	bool IsDockedTo ( class UUIScreenObject* TargetWidget, unsigned char SourceFace, unsigned char TargetFace );
	bool GetDockParameters ( unsigned char SourceFace, class UUIScreenObject** TargetWidget, unsigned char* TargetFace, float* TargetPadding );
	bool SetDockParameters ( unsigned char SourceFace, class UUIScreenObject* Target, unsigned char TargetFace, float PaddingValue, unsigned char PaddingInputType, unsigned long bModifyPaddingScaleType );
	bool SetDockPadding ( unsigned char SourceFace, float PaddingValue, unsigned char PaddingInputType, unsigned long bModifyPaddingScaleType );
	bool SetDockTarget ( unsigned char SourceFace, class UUIScreenObject* Target, unsigned char TargetFace );
	bool IsContainedBy ( class UUIObject* TestWidget );
	void NotifyValueChanged ( int PlayerIndex, int NotifyFlags );
	struct FMatrix GenerateTransformMatrix ( unsigned long bIncludeParentTransforms );
	bool HasTransform ( unsigned long bIncludeParentTransforms );
};

//UClass* UUIObject::pClassPointer = NULL;

// Class Engine.CustomUIObject
// 0x0170 (0x02D0 - 0x0160)
class UCustomUIObject : public UUIObject
{
public:
	unsigned char                                      ScaleAlignment[ 0x2 ];                            		// 0x0160 (0x0002) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      ClippingFace;                                     		// 0x0162 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      IsVisibleStarted : 1;                             		// 0x0164 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bVisibleBlend : 1;                                		// 0x0164 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bVisibleScale : 1;                                		// 0x0164 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bNeverActivate : 1;                               		// 0x0164 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      bIgnoreReplay : 1;                                		// 0x0164 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      IgnoreInputClicked : 1;                           		// 0x0164 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      IgnoreInputRClicked : 1;                          		// 0x0164 (0x0004) [0x0000000000000001] [0x00000040] ( CPF_Edit )
	unsigned long                                      EnableResize : 1;                                 		// 0x0164 (0x0004) [0x0000000000000001] [0x00000080] ( CPF_Edit )
	unsigned long                                      EnableBoundResize : 1;                            		// 0x0164 (0x0004) [0x0000000000000001] [0x00000100] ( CPF_Edit )
	unsigned long                                      bIgnoreHorizontalEnableResize : 1;                		// 0x0164 (0x0004) [0x0000000000000001] [0x00000200] ( CPF_Edit )
	unsigned long                                      bIgnoreVerticalEnableResize : 1;                  		// 0x0164 (0x0004) [0x0000000000000001] [0x00000400] ( CPF_Edit )
	unsigned long                                      bIgnoreBoundResize : 1;                           		// 0x0164 (0x0004) [0x0000000000000001] [0x00000800] ( CPF_Edit )
	unsigned long                                      bHorizontalResizeHide : 1;                        		// 0x0164 (0x0004) [0x0000000000000001] [0x00001000] ( CPF_Edit )
	unsigned long                                      bVerticalResizeHide : 1;                          		// 0x0164 (0x0004) [0x0000000000000001] [0x00002000] ( CPF_Edit )
	unsigned long                                      bEnableActivateEvent : 1;                         		// 0x0164 (0x0004) [0x0000000000000001] [0x00004000] ( CPF_Edit )
	unsigned long                                      bChildrenEnableActivateEvent : 1;                 		// 0x0164 (0x0004) [0x0000000000000001] [0x00008000] ( CPF_Edit )
	unsigned long                                      bEnableActiveOnly : 1;                            		// 0x0164 (0x0004) [0x0000000000000001] [0x00010000] ( CPF_Edit )
	unsigned long                                      bEnableActivateWithParentRender : 1;              		// 0x0164 (0x0004) [0x0000000000000001] [0x00020000] ( CPF_Edit )
	unsigned long                                      bEnablePressedWithParentRender : 1;               		// 0x0164 (0x0004) [0x0000000000000001] [0x00040000] ( CPF_Edit )
	unsigned long                                      bEnableWheel : 1;                                 		// 0x0164 (0x0004) [0x0000000000000001] [0x00080000] ( CPF_Edit )
	unsigned long                                      bIgnoreOwnerWheelEvent : 1;                       		// 0x0164 (0x0004) [0x0000000000000001] [0x00100000] ( CPF_Edit )
	unsigned long                                      bEnableHorizontalResizeLink : 1;                  		// 0x0164 (0x0004) [0x0000000000000000] [0x00200000] 
	unsigned long                                      bEnableVerticalResizeLink : 1;                    		// 0x0164 (0x0004) [0x0000000000000000] [0x00400000] 
	unsigned long                                      bEnableActiveParticle : 1;                        		// 0x0164 (0x0004) [0x0000000000000000] [0x00800000] 
	unsigned long                                      bEnableRuntimeHorizontalResizeLink : 1;           		// 0x0164 (0x0004) [0x0000000000002000] [0x01000000] ( CPF_Transient )
	unsigned long                                      bEnableRuntimeVerticalResizeLink : 1;             		// 0x0164 (0x0004) [0x0000000000002000] [0x02000000] ( CPF_Transient )
	unsigned long                                      bIsActivateEvent : 1;                             		// 0x0164 (0x0004) [0x0000000000002000] [0x04000000] ( CPF_Transient )
	unsigned long                                      bEnableGray : 1;                                  		// 0x0164 (0x0004) [0x0000000000002000] [0x08000000] ( CPF_Transient )
	unsigned long                                      bIgnoreLockCursor : 1;                            		// 0x0164 (0x0004) [0x0000000000002000] [0x10000000] ( CPF_Transient )
	unsigned long                                      bVisibleInternalEvent : 1;                        		// 0x0164 (0x0004) [0x0000000000002000] [0x20000000] ( CPF_Transient )
	unsigned long                                      bEnableRenderStateFromChild : 1;                  		// 0x0164 (0x0004) [0x0000000000002000] [0x40000000] ( CPF_Transient )
	unsigned long                                      bRecursiveRenaming : 1;                           		// 0x0164 (0x0004) [0x0000000000002000] [0x80000000] ( CPF_Transient )
	unsigned long                                      bEnableState : 1;                                 		// 0x0168 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bNeedRefreshContainer : 1;                        		// 0x0168 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      bScalePosition : 1;                               		// 0x0168 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      bHasLocalDestBound : 1;                           		// 0x0168 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
	struct FString                                     WidgetClassType;                                  		// 0x016C (0x000C) [0x0000000000002001]              ( CPF_Edit | CPF_Transient )
	class USoundCue*                                   ShowEvent;                                        		// 0x0178 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   HideEvent;                                        		// 0x017C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   ActiveEvent;                                      		// 0x0180 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   DeactiveEvent;                                    		// 0x0184 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     MetaData;                                         		// 0x0188 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	class UImageSet*                                   RegionImageSet;                                   		// 0x0194 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FResizeLink                                 HorizontalResizeLink;                             		// 0x0198 (0x0014) [0x0000000000000001]              ( CPF_Edit )
	struct FResizeLink                                 VerticalResizeLink;                               		// 0x01AC (0x0014) [0x0000000000000001]              ( CPF_Edit )
	struct FUIParticle                                 ActiveParticle;                                   		// 0x01C0 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FExpansionComponent >               ExpansionComponentArray;                          		// 0x01DC (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FResizeLink                                 RuntimeHorizontalResizeLink;                      		// 0x01E8 (0x0014) [0x0000000000002000]              ( CPF_Transient )
	struct FResizeLink                                 RuntimeVerticalResizeLink;                        		// 0x01FC (0x0014) [0x0000000000002000]              ( CPF_Transient )
	float                                              fFadeTime;                                        		// 0x0210 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              fCurrentScale;                                    		// 0x0214 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                PressedTextLinkId;                                		// 0x0218 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                ActivateCursorType;                               		// 0x021C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FCustomDragInfo                             DragInfo;                                         		// 0x0220 (0x001C) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FDrawComponentInfo >                DrawComponentArray;                               		// 0x023C (0x000C) [0x0000000000002000]              ( CPF_Transient )
	float                                              fContentsOpacity;                                 		// 0x0248 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              fEffectOpacity;                                   		// 0x024C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FWidgetClippingBoundInfo >          ClippingBoundArray;                               		// 0x0250 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	float                                              fClippingRatio;                                   		// 0x025C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FUIParticleRenderInfo >             ParticleRenderArray;                              		// 0x0260 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FUIParticleUpdateInfo >             ParticleUpdateArray;                              		// 0x026C (0x000C) [0x0000000000002000]              ( CPF_Transient )
	int                                                ReleaseTickCount;                                 		// 0x0278 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FName >                             PressedKeyArray;                                  		// 0x027C (0x000C) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FName >                             InputAllowedKeyArray;                             		// 0x0288 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	TArray< unsigned char >                            RemainedAnimFactors;                              		// 0x0294 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	int                                                PositionAnimInstId;                               		// 0x02A0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                ResizeAnimInstId;                                 		// 0x02A4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                ScaleAnimInstId;                                  		// 0x02A8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                AlphaAnimInstId;                                  		// 0x02AC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                ShowAnimInstId;                                   		// 0x02B0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                HideAnimInstId;                                   		// 0x02B4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                ClippingAnimInstId;                               		// 0x02B8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FBoundInfo                                  LocalDestBound;                                   		// 0x02BC (0x0014) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 137 ];

		return pClassPointer;
	};

	bool SetFocus ( class UUIScreenObject* Sender, int PlayerIndex );
};

//UClass* UCustomUIObject::pClassPointer = NULL;

// Class Engine.CustomUIImageText
// 0x0078 (0x0348 - 0x02D0)
class UCustomUIImageText : public UCustomUIObject
{
public:
	unsigned long                                      AutoResizeHorizontal : 1;                         		// 0x02D0 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      AutoResizeVertical : 1;                           		// 0x02D0 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bNeedToRefresh : 1;                               		// 0x02D0 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	float                                              MaxAutoResizeHorizontal;                          		// 0x02D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MaxAutoResizeVertical;                            		// 0x02D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MinAutoResizeHorizontal;                          		// 0x02DC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MinAutoResizeVertical;                            		// 0x02E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      TextAlignmentHorizontal;                          		// 0x02E4 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      TextAlignmentVertical;                            		// 0x02E5 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FImageTextInfo >                    ImageTextInfoArray;                               		// 0x02E8 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     ImageTextValue;                                   		// 0x02F4 (0x000C) [0x0000000000002001]              ( CPF_Edit | CPF_Transient )
	struct FString                                     SourceText;                                       		// 0x0300 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	unsigned char                                      UnknownData00[ 0x3C ];                            		// 0x030C (0x003C) UNKNOWN PROPERTY: MapProperty Engine.CustomUIImageText.ImageTextInfoMap

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 136 ];

		return pClassPointer;
	};

};

//UClass* UCustomUIImageText::pClassPointer = NULL;

// Class Engine.CustomUISliderBox
// 0x002C (0x02FC - 0x02D0)
class UCustomUISliderBox : public UCustomUIObject
{
public:
	class UCustomUIComp_DrawImage*                     BackgroundImageComponent;                         		// 0x02D0 (0x0004) [0x000000000000000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject )
	class UCustomUIComp_DrawImage*                     HighlightImageComponent;                          		// 0x02D4 (0x0004) [0x000000000000000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject )
	class USoundCue*                                   MarkerEvent;                                      		// 0x02D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bEnableHighlight : 1;                             		// 0x02DC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	class UCustomUIButton*                             MarkerButton;                                     		// 0x02E0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FVector2D                                   MaxSliderValue;                                   		// 0x02E4 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	struct FVector2D                                   MinSliderValue;                                   		// 0x02EC (0x0008) [0x0000000000002000]              ( CPF_Transient )
	struct FVector2D                                   CurSliderValue;                                   		// 0x02F4 (0x0008) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 146 ];

		return pClassPointer;
	};

	void OnMarkerDrop ( class UUIScreenObject* Sender );
	void OnMarkerDragStart ( class UUIScreenObject* Sender );
	void OnMarkerDrag ( class UUIScreenObject* Sender );
};

//UClass* UCustomUISliderBox::pClassPointer = NULL;

// Class Engine.CustomUIArrow
// 0x0054 (0x0324 - 0x02D0)
class UCustomUIArrow : public UCustomUIObject
{
public:
	int                                                ColumnCount;                                      		// 0x02D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                RowCount;                                         		// 0x02D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ColumnGap;                                        		// 0x02D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              RowGap;                                           		// 0x02DC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              LineSize;                                         		// 0x02E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ArrowSize;                                        		// 0x02E4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              HorizontalLineOffset;                             		// 0x02E8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UImageSet*                                   HorizontalLineImageSet;                           		// 0x02EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UImageSet*                                   VerticalLineImageSet;                             		// 0x02F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UImageSet*                                   ArrowImageSet;                                    		// 0x02F4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UImageSet*                                   LBLineImageSet;                                   		// 0x02F8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UImageSet*                                   RBLineImageSet;                                   		// 0x02FC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UImageSet*                                   TRLineImageSet;                                   		// 0x0300 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UImageSet*                                   TLLineImageSet;                                   		// 0x0304 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UCustomUIImage*                              TemplateWidget;                                   		// 0x0308 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FUIArrowLine >                      ArrowLineArray;                                   		// 0x030C (0x000C) [0x0000000000002001]              ( CPF_Edit | CPF_Transient )
	struct FWidgetContainerSystemInfo                  ArrowContainerSystemInfo;                         		// 0x0318 (0x000C) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 148 ];

		return pClassPointer;
	};

};

//UClass* UCustomUIArrow::pClassPointer = NULL;

// Class Engine.CustomUIScrollIndex
// 0x0064 (0x0334 - 0x02D0)
class UCustomUIScrollIndex : public UCustomUIObject
{
public:
	class UCustomUIComp_DrawImage*                     BackgroundImageComponent;                         		// 0x02D0 (0x0004) [0x000000000000000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject )
	class USoundCue*                                   PressedEvent;                                     		// 0x02D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UFontSet*                                    FontSet;                                          		// 0x02D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   MinIndexEntrySize;                                		// 0x02DC (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              Padding;                                          		// 0x02E4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   ImagePadding;                                     		// 0x02E8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              SeparationGap;                                    		// 0x02F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UImageSet*                                   MouseOverImageSet;                                		// 0x02F4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UImageSet*                                   PressedImageSet;                                  		// 0x02F8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     SeparationText;                                   		// 0x02FC (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FVector2D                                   IndexEntrySize;                                   		// 0x0308 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	struct FVector2D                                   SeparationSize;                                   		// 0x0310 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bEnableDrawBackgrondImage : 1;                    		// 0x0318 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	int                                                MouseOverIndexEntry;                              		// 0x031C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                PressedIndexEntry;                                		// 0x0320 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              VerticalGap;                                      		// 0x0324 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FIndexEntryInfo >                   IndexEntryArray;                                  		// 0x0328 (0x000C) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 150 ];

		return pClassPointer;
	};

};

//UClass* UCustomUIScrollIndex::pClassPointer = NULL;

// Class Engine.CustomUIWebBrowser
// 0x0030 (0x0300 - 0x02D0)
class UCustomUIWebBrowser : public UCustomUIObject
{
public:
	unsigned long                                      bEnableStartShowScrollbar : 1;                    		// 0x02D0 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bEnableWebResize : 1;                             		// 0x02D0 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bUseExternalLink : 1;                             		// 0x02D0 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bIsWebTextureInputFocus : 1;                      		// 0x02D0 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
	unsigned long                                      bAlwaysUpdate : 1;                                		// 0x02D0 (0x0004) [0x0000000000002000] [0x00000010] ( CPF_Transient )
	unsigned long                                      bEnableJavascriptConsoleMessage : 1;              		// 0x02D0 (0x0004) [0x0000000000002000] [0x00000020] ( CPF_Transient )
	unsigned long                                      bEnableGlobalState : 1;                           		// 0x02D0 (0x0004) [0x0000000000002000] [0x00000040] ( CPF_Transient )
	unsigned long                                      bEnableUseWebViewPool : 1;                        		// 0x02D0 (0x0004) [0x0000000000002000] [0x00000080] ( CPF_Transient )
	int                                                IndexWebTexture;                                  		// 0x02D4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FVector2D                                   WebPageSize;                                      		// 0x02D8 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FString >                           FilePaths;                                        		// 0x02E0 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FString                                     FocusedId;                                        		// 0x02EC (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FQWord                                      IMEContext;                                       		// 0x02F8 (0x0008) [0x0000000000003000]              ( CPF_Native | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 152 ];

		return pClassPointer;
	};

};

//UClass* UCustomUIWebBrowser::pClassPointer = NULL;

// Class Engine.CustomUIRadialGraph
// 0x007C (0x034C - 0x02D0)
class UCustomUIRadialGraph : public UCustomUIObject
{
public:
	int                                                AngleCount;                                       		// 0x02D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Radius;                                           		// 0x02D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              LineThickness;                                    		// 0x02D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      EnableDrawLine : 1;                               		// 0x02DC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      EnableAutoCorrectCenterPosition : 1;              		// 0x02DC (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bNeedsUpdate : 1;                                 		// 0x02DC (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	struct FLinearColor                                FanColor;                                         		// 0x02E0 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                LineColor;                                        		// 0x02F0 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	class UImageSet*                                   BackgroundImage;                                  		// 0x0300 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< float >                                    Values;                                           		// 0x0304 (0x000C) [0x0000000000002001]              ( CPF_Edit | CPF_Transient )
	class UTexture2D*                                  OutLineTexture;                                   		// 0x0310 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FVector2D >                         RenderOutLinePointPositions;                      		// 0x0314 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FVector2D >                         RenderPointPositions;                             		// 0x0320 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FVector2D >                         RenderPointTexCoords;                             		// 0x032C (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FVector2D                                   CenterPosition;                                   		// 0x0338 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	TArray< int >                                      ValueAnimInstIdArray;                             		// 0x0340 (0x000C) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 154 ];

		return pClassPointer;
	};

};

//UClass* UCustomUIRadialGraph::pClassPointer = NULL;

// Class Engine.CustomUIReading
// 0x0014 (0x02E4 - 0x02D0)
class UCustomUIReading : public UCustomUIObject
{
public:
	class UCustomUIComp_DrawImage*                     ImageComponent;                                   		// 0x02D0 (0x0004) [0x000000000000000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject )
	class UFontSet*                                    FontSet;                                          		// 0x02D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   Padding;                                          		// 0x02D8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              SpaceBetweenLines;                                		// 0x02E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 156 ];

		return pClassPointer;
	};

};

//UClass* UCustomUIReading::pClassPointer = NULL;

// Class Engine.CustomUICandidate
// 0x0018 (0x02E8 - 0x02D0)
class UCustomUICandidate : public UCustomUIObject
{
public:
	class UCustomUIComp_DrawImage*                     ImageComponent;                                   		// 0x02D0 (0x0004) [0x000000000000000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject )
	class UFontSet*                                    FontSet;                                          		// 0x02D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UImageSet*                                   SelectionImageSet;                                		// 0x02D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   Padding;                                          		// 0x02DC (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              SpaceBetweenLines;                                		// 0x02E4 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 158 ];

		return pClassPointer;
	};

};

//UClass* UCustomUICandidate::pClassPointer = NULL;

// Class Engine.CustomUIImage
// 0x002C (0x02FC - 0x02D0)
class UCustomUIImage : public UCustomUIObject
{
public:
	class UCustomUIComp_DrawImage*                     ImageComponent;                                   		// 0x02D0 (0x0004) [0x000000000000000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject )
	unsigned long                                      EnableDrawImage : 1;                              		// 0x02D4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bEnableClickedParticle : 1;                       		// 0x02D4 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bClickEvent : 1;                                  		// 0x02D4 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bRClickEvent : 1;                                 		// 0x02D4 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      bEnableLeftButton : 1;                            		// 0x02D4 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      bEnableRightButton : 1;                           		// 0x02D4 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      bEnableDoubleClick : 1;                           		// 0x02D4 (0x0004) [0x0000000000000001] [0x00000040] ( CPF_Edit )
	unsigned long                                      bUseWheel : 1;                                    		// 0x02D4 (0x0004) [0x0000000000000001] [0x00000080] ( CPF_Edit )
	unsigned long                                      bPressedInput : 1;                                		// 0x02D4 (0x0004) [0x0000000000002000] [0x00000100] ( CPF_Transient )
	unsigned long                                      bIsClickEvent : 1;                                		// 0x02D4 (0x0004) [0x0000000000002000] [0x00000200] ( CPF_Transient )
	unsigned long                                      bDragEnabled : 1;                                 		// 0x02D4 (0x0004) [0x0000000000002000] [0x00000400] ( CPF_Transient )
	unsigned long                                      bDragLockEnabled : 1;                             		// 0x02D4 (0x0004) [0x0000000000002000] [0x00000800] ( CPF_Transient )
	unsigned long                                      bIsDoubleClickPress : 1;                          		// 0x02D4 (0x0004) [0x0000000000002000] [0x00001000] ( CPF_Transient )
	struct FUIParticle                                 ClickedParticle;                                  		// 0x02D8 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   ClickedEvent;                                     		// 0x02F4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   PresedEvent;                                      		// 0x02F8 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 162 ];

		return pClassPointer;
	};

};

//UClass* UCustomUIImage::pClassPointer = NULL;

// Class Engine.CustomUIPanel
// 0x0024 (0x0320 - 0x02FC)
class UCustomUIPanel : public UCustomUIImage
{
public:
	class UCustomUIComp_DrawImage*                     CustomizeImageComponent;                          		// 0x02FC (0x0004) [0x000000000000000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject )
	unsigned long                                      bEnableTopOrder : 1;                              		// 0x0300 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bEnableCustomize : 1;                             		// 0x0300 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bIgnoreCustomize : 1;                             		// 0x0300 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bIgnoreClearInputFocus : 1;                       		// 0x0300 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      AdjustAspectRatio : 1;                            		// 0x0300 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      EanableFittedHorizontalAspectRatio : 1;           		// 0x0300 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
