#pragma once

/*
#############################################################################################
# Blade and Soul (25) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: T1Game_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
# Mentions: Ant.
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function T1Game.T1GameViewportClient.DrawTransition
// [0x00020002] 
struct UT1GameViewportClient_execDrawTransition_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1GameViewportClient.PostRender
// [0x00020802] ( FUNC_Event )
struct UT1GameViewportClient_eventPostRender_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1GameViewportClient.Init
// [0x00420802] ( FUNC_Event )
struct UT1GameViewportClient_eventInit_Parms
{
	struct FString                                     OutError;                                         		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1GameViewportClient.PostRenderT1
// [0x00020400] ( FUNC_Native )
struct UT1GameViewportClient_execPostRenderT1_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.AlignPlayerPawnToCameraDirection
// [0x00820202] ( FUNC_Exec )
struct AT1PlayerController_execAlignPlayerPawnToCameraDirection_Parms
{
	// class APlayerController*                        PC;                                               		// 0x0000 (0x0004) [0x0000000000000000]              
	// struct FRotator                                 LocalRotation;                                    		// 0x0004 (0x000C) [0x0000000000000000]              
};

// Function T1Game.T1PlayerController.CameraMove
// [0x00420802] ( FUNC_Event )
struct AT1PlayerController_eventCameraMove_Parms
{
	float                                              Duration;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Pct;                                              		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FRawDistributionVector                      newRotAdjust;                                     		// 0x0008 (0x001C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
	struct FRawDistributionVector                      newLocAdjust;                                     		// 0x0024 (0x001C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
	struct FRawDistributionFloat                       newFovAdjust;                                     		// 0x0040 (0x001C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
};

// Function T1Game.T1PlayerController.CameraShake
// [0x00824802] ( FUNC_Event )
struct AT1PlayerController_eventCameraShake_Parms
{
	float                                              Duration;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     newRotAmplitude;                                  		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     newRotFrequency;                                  		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     newLocAmplitude;                                  		// 0x001C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     newLocFrequency;                                  		// 0x0028 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              newFOVAmplitude;                                  		// 0x0034 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              newFOVFrequency;                                  		// 0x0038 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bRotRandom : 1;                                   		// 0x003C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bLocRandom : 1;                                   		// 0x0040 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bFOVRandom : 1;                                   		// 0x0044 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	// class UForceFeedbackWaveform*                   CameraShakeWaveform;                              		// 0x0048 (0x0004) [0x0000000000000000]              
	// struct FWaveformSample                          Sample;                                           		// 0x004C (0x0008) [0x0000000000000000]              
	// struct FVector                                  AmplitudeVector;                                  		// 0x0054 (0x000C) [0x0000000000000000]              
	// float                                           Amplitude;                                        		// 0x0060 (0x0004) [0x0000000000000000]              
};

// Function T1Game.T1PlayerController.PlayerMove
// [0x00820002] 
struct AT1PlayerController_execPlayerMove_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  X;                                                		// 0x0004 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Y;                                                		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Z;                                                		// 0x001C (0x000C) [0x0000000000000000]              
	// unsigned long                                   bSaveJump : 1;                                    		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function T1Game.T1PlayerController.CheckJumpOrDuck
// [0x00020002] 
struct AT1PlayerController_execCheckJumpOrDuck_Parms
{
	// unsigned long                                   IsJump : 1;                                       		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function T1Game.T1PlayerController.PlayerTick
// [0x00020002] 
struct AT1PlayerController_execPlayerTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// float                                           fInterpSpeed;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
	// float                                           fResult;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function T1Game.T1PlayerController.ProcessViewRotation
// [0x00420002] 
struct AT1PlayerController_execProcessViewRotation_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    out_ViewRotation;                                 		// 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    DeltaRot;                                         		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.UpdateRotation
// [0x00820002] 
struct AT1PlayerController_execUpdateRotation_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FRotator                                 DeltaRot;                                         		// 0x0004 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 NewRotation;                                      		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 ViewRotation;                                     		// 0x001C (0x000C) [0x0000000000000000]              
};

// Function T1Game.T1PlayerController.ShoulderPosCamDist
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execShoulderPosCamDist_Parms
{
	float                                              fDist;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.ShoulderPosY
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execShoulderPosY_Parms
{
	float                                              fY;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.ShoulderPosX
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execShoulderPosX_Parms
{
	float                                              fX;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.ShoulderPos
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execShoulderPos_Parms
{
	float                                              fX;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fY;                                               		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDist;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.TargetZoom
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execTargetZoom_Parms
{
	float                                              fTargetZoom;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.TargetRot
// [0x00820202] ( FUNC_Exec )
struct AT1PlayerController_execTargetRot_Parms
{
	float                                              fPitch;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fYaw;                                             		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FRotator                                 Rot;                                              		// 0x0008 (0x000C) [0x0000000000000000]              
};

// Function T1Game.T1PlayerController.SetCamTargetHeightNear
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execSetCamTargetHeightNear_Parms
{
	float                                              fHeight;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.CamTargetHeightNearDown
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execCamTargetHeightNearDown_Parms
{
};

// Function T1Game.T1PlayerController.CamTargetHeightNearUp
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execCamTargetHeightNearUp_Parms
{
};

// Function T1Game.T1PlayerController.SetCamTargetHeight
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execSetCamTargetHeight_Parms
{
	float                                              fHeight;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.CamTargetHeightDown
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execCamTargetHeightDown_Parms
{
};

// Function T1Game.T1PlayerController.CamTargetHeightUp
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execCamTargetHeightUp_Parms
{
};

// Function T1Game.T1PlayerController.SetCharacterShowMode
// [0x00020400] ( FUNC_Native )
struct AT1PlayerController_execSetCharacterShowMode_Parms
{
	unsigned long                                      bFlag : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function T1Game.T1PlayerController.NativeAccel
// [0x00020400] ( FUNC_Native )
struct AT1PlayerController_execNativeAccel_Parms
{
	struct FVector                                     X;                                                		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Y;                                                		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Z;                                                		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0024 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1PlayerController.ToggleCamInfo
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct AT1PlayerController_execToggleCamInfo_Parms
{
};

// Function T1Game.T1PlayerController.SetFovAtMax
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execSetFovAtMax_Parms
{
	float                                              FOV;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.SetFovAtZero
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execSetFovAtZero_Parms
{
	float                                              FOV;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.SetCamNearDist
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execSetCamNearDist_Parms
{
	float                                              fDist;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.SetCamMaxDist
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execSetCamMaxDist_Parms
{
	float                                              fDist;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.SetCamMinDist
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execSetCamMinDist_Parms
{
	float                                              fDist;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.SetCamHeightTransDist
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execSetCamHeightTransDist_Parms
{
	float                                              fDist;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.SetDollyFactor
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct AT1PlayerController_execSetDollyFactor_Parms
{
	float                                              fNewDollyFactor;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.Dolly
// [0x00020002] 
struct AT1PlayerController_execDolly_Parms
{
	float                                              fDollyFactor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// float                                           fResult;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function T1Game.T1PlayerController.CharacterFitDolly
// [0x00020002] 
struct AT1PlayerController_execCharacterFitDolly_Parms
{
	float                                              fDollyFactor;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           fNewDestFreeCamDistance;                          		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function T1Game.T1PlayerController.DollyOut
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execDollyOut_Parms
{
};

// Function T1Game.T1PlayerController.DollyIn
// [0x00020202] ( FUNC_Exec )
struct AT1PlayerController_execDollyIn_Parms
{
	// int                                             iBoundaryState;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function T1Game.T1PlayerController.Face
// [0x00020200] ( FUNC_Exec )
struct AT1PlayerController_execFace_Parms
{
	int                                                a_Type;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.Hair
// [0x00020200] ( FUNC_Exec )
struct AT1PlayerController_execHair_Parms
{
	int                                                a_Type;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.Costume
// [0x00020200] ( FUNC_Exec )
struct AT1PlayerController_execCostume_Parms
{
	int                                                a_Type;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.ChangeSet
// [0x00020200] ( FUNC_Exec )
struct AT1PlayerController_execChangeSet_Parms
{
	int                                                a_Type;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerController.execAttackReq
// [0x00020200] ( FUNC_Exec )
struct AT1PlayerController_execexecAttackReq_Parms
{
};

// Function T1Game.T1PlayerInput.ToggleRotateTypeForJoypad
// [0x00020202] ( FUNC_Exec )
struct UT1PlayerInput_execToggleRotateTypeForJoypad_Parms
{
	// unsigned char                                   Temp;                                             		// 0x0000 (0x0001) [0x0000000000000000]              
};

// Function T1Game.T1PlayerInput.DisableRotateForJoypad
// [0x00020202] ( FUNC_Exec )
struct UT1PlayerInput_execDisableRotateForJoypad_Parms
{
};

// Function T1Game.T1PlayerInput.EnableRotateForJoypad
// [0x00020202] ( FUNC_Exec )
struct UT1PlayerInput_execEnableRotateForJoypad_Parms
{
};

// Function T1Game.T1PlayerInput.ToggleKeepWalking
// [0x00020202] ( FUNC_Exec )
struct UT1PlayerInput_execToggleKeepWalking_Parms
{
};

// Function T1Game.T1PlayerInput.QuickTurn
// [0x00020202] ( FUNC_Exec )
struct UT1PlayerInput_execQuickTurn_Parms
{
};

// Function T1Game.T1PlayerInput.ResetCamera
// [0x00020202] ( FUNC_Exec )
struct UT1PlayerInput_execResetCamera_Parms
{
};

// Function T1Game.T1PlayerInput.GlideDrop
// [0x00020202] ( FUNC_Exec )
struct UT1PlayerInput_execGlideDrop_Parms
{
};

// Function T1Game.T1PlayerInput.UnDash
// [0x00020202] ( FUNC_Exec )
struct UT1PlayerInput_execUnDash_Parms
{
};

// Function T1Game.T1PlayerInput.Dash
// [0x00020202] ( FUNC_Exec )
struct UT1PlayerInput_execDash_Parms
{
};

// Function T1Game.T1PlayerInput.SetTPSInnerMode
// [0x00020400] ( FUNC_Native )
struct UT1PlayerInput_execSetTPSInnerMode_Parms
{
	unsigned char                                      InMode;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1PlayerInput.IsRotateCamOnly
// [0x00020400] ( FUNC_Native )
struct UT1PlayerInput_execIsRotateCamOnly_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1PlayerInput.IsRotatePlayer
// [0x00020400] ( FUNC_Native )
struct UT1PlayerInput_execIsRotatePlayer_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1PlayerInput.PlayerInput
// [0x00020802] ( FUNC_Event )
struct UT1PlayerInput_eventPlayerInput_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// float                                           TimeScale;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	// float                                           fMoveDist;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bSetCursorVisible : 1;                            		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	// unsigned long                                   bUseStrafe : 1;                                   		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// unsigned long                                   bIsMouseMove : 1;                                 		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function T1Game.T1SceneCaptureMapVolumeActor.GetRenderedResult
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct AT1SceneCaptureMapVolumeActor_execGetRenderedResult_Parms
{
	class UTexture2D*                                  ResultTexture;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.IsActorPlayingFaceFXAnim
// [0x00020102] 
struct AT1CustomPawn_execIsActorPlayingFaceFXAnim_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.GetActorFaceFXAsset
// [0x00020902] ( FUNC_Event )
struct AT1CustomPawn_eventGetActorFaceFXAsset_Parms
{
	class UFaceFXAsset*                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.OnPlayFaceFXAnim
// [0x00020102] 
struct AT1CustomPawn_execOnPlayFaceFXAnim_Parms
{
	class USeqAct_PlayFaceFXAnim*                      inAction;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class APlayerController*                        PC;                                               		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function T1Game.T1CustomPawn.FinishAnimControl
// [0x00020902] ( FUNC_Event )
struct AT1CustomPawn_eventFinishAnimControl_Parms
{
};

// Function T1Game.T1CustomPawn.StartPawnFadeIn
// [0x00020902] ( FUNC_Event )
struct AT1CustomPawn_eventStartPawnFadeIn_Parms
{
};

// Function T1Game.T1CustomPawn.BeginAnimControl
// [0x00020902] ( FUNC_Event )
struct AT1CustomPawn_eventBeginAnimControl_Parms
{
	TArray< class UAnimSet* >                          InAnimSets;                                       		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// class UAnimNodeSequence*                        SeqNode;                                          		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function T1Game.T1CustomPawn.GetFaceFXAudioComponent
// [0x00020902] ( FUNC_Event )
struct AT1CustomPawn_eventGetFaceFXAudioComponent_Parms
{
	class UAudioComponent*                             ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.StopActorFaceFXAnim
// [0x00020902] ( FUNC_Event )
struct AT1CustomPawn_eventStopActorFaceFXAnim_Parms
{
};

// Function T1Game.T1CustomPawn.IsPlayingFaceFXAnim
// [0x00020902] ( FUNC_Event )
struct AT1CustomPawn_eventIsPlayingFaceFXAnim_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.PlayActorFaceFXAnim
// [0x00024902] ( FUNC_Event )
struct AT1CustomPawn_eventPlayActorFaceFXAnim_Parms
{
	class UFaceFXAnimSet*                              AnimSet;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     GroupName;                                        		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     SeqName;                                          		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                SoundTrackType;                                   		// 0x001C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      InStopPrevious : 1;                               		// 0x0020 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.GetHitPosition
// [0x00024400] ( FUNC_Native )
struct AT1CustomPawn_execGetHitPosition_Parms
{
	struct FString                                     StartBone;                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AT1CustomPawn*                               TargetPawn;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     TargetBone;                                       		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              fMoveDist;                                        		// 0x001C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0020 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.GetVehicleState
// [0x00020902] ( FUNC_Event )
struct AT1CustomPawn_eventGetVehicleState_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.SetMyVehicle
// [0x00020902] ( FUNC_Event )
struct AT1CustomPawn_eventSetMyVehicle_Parms
{
	class AT1CustomPawn*                               Vehicle;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.PostKismet
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execPostKismet_Parms
{
};

// Function T1Game.T1CustomPawn.IsValidDriver
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execIsValidDriver_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.IsRideDriver
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execIsRideDriver_Parms
{
	class AT1CustomPawn*                               Driver;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.CanEnterVehicle
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execCanEnterVehicle_Parms
{
	struct FString                                     BoneName;                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.SetVehicleAni
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetVehicleAni_Parms
{
	struct FString                                     strAnimName;                                      		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              fAnimSpeed;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fAnimBlendIn;                                     		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fAnimBlendOut;                                    		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      Loop : 1;                                         		// 0x0018 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x001C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.IsVehicleRide
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execIsVehicleRide_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.IsReadyVehicleLeave
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execIsReadyVehicleLeave_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.IsReadyVehicleRide
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execIsReadyVehicleRide_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.CanDriving
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execCanDriving_Parms
{
	struct FString                                     BoneName;                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.GetBoundBoxForRender
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execGetBoundBoxForRender_Parms
{
	class AT1CustomPawn*                               Pawn;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FBox                                        ReturnValue;                                      		// 0x0004 (0x001C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.SwapPawnController
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSwapPawnController_Parms
{
	class AT1CustomPawn*                               FirstPawn;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AT1CustomPawn*                               SecondPawn;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.DetachToVehicle
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execDetachToVehicle_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.AttachToVehicle
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execAttachToVehicle_Parms
{
	struct FString                                     DriveBoneName;                                    		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     VehicleBoneName;                                  		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Offset;                                           		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.RideVehicle
// [0x00024400] ( FUNC_Native )
struct AT1CustomPawn_execRideVehicle_Parms
{
	struct FString                                     strAnimName;                                      		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                iPriority;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fAnimSpeed;                                       		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fAnimBlendIn;                                     		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fAnimBlendOut;                                    		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bLoop : 1;                                        		// 0x001C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bBlockMove : 1;                                   		// 0x0020 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bBlockRotate : 1;                                 		// 0x0024 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bNextAnim : 1;                                    		// 0x0028 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x002C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.ChildParticleRelativePos
// [0x00024400] ( FUNC_Native )
struct AT1CustomPawn_execChildParticleRelativePos_Parms
{
	class AEmitter*                                    Particle;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fRelX;                                            		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fRelY;                                            		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fRelZ;                                            		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                BoneUseType;                                      		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FName                                       BoneName;                                         		// 0x0014 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function T1Game.T1CustomPawn.ChildParticleDetach
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execChildParticleDetach_Parms
{
	class AEmitter*                                    Particle;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.ChildParticleAttach
// [0x00024400] ( FUNC_Native )
struct AT1CustomPawn_execChildParticleAttach_Parms
{
	class AEmitter*                                    Particle;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fRelX;                                            		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fRelY;                                            		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fRelZ;                                            		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                BoneUseType;                                      		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FName                                       BoneName;                                         		// 0x0014 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function T1Game.T1CustomPawn.MakeFootPrint
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execMakeFootPrint_Parms
{
	class UPhysicalMaterial*                           PhysMaterial;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                iFootPrintInfoId;                                 		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     FootLocation;                                     		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    FootRotation;                                     		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.UpdateWaterPrint
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execUpdateWaterPrint_Parms
{
	class UPhysicalMaterial*                           PhysMaterial;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.UpdateFootPrint
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execUpdateFootPrint_Parms
{
	class UPhysicalMaterial*                           PhysMaterial;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.ChangeAnimSpeed
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execChangeAnimSpeed_Parms
{
	int                                                iMeshIndex;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCustomAnimSpeed;                                 		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fPlayTime;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.LogForMoveAnimName
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execLogForMoveAnimName_Parms
{
};

// Function T1Game.T1CustomPawn.SetFadingAlpha
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetFadingAlpha_Parms
{
	int                                                iMeshIndex;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fAlpha;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.SetFadingState
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetFadingState_Parms
{
	int                                                iMeshIndex;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                iType;                                            		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.UpdateResetPhysicsBones
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execUpdateResetPhysicsBones_Parms
{
};

// Function T1Game.T1CustomPawn.SetResetPhysicsBoneFlag
// [0x00024400] ( FUNC_Native )
struct AT1CustomPawn_execSetResetPhysicsBoneFlag_Parms
{
	int                                                Flag;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                iMaxResetBonesCount;                              		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function T1Game.T1CustomPawn.SetOutLineBloomInfo
// [0x00024400] ( FUNC_Native )
struct AT1CustomPawn_execSetOutLineBloomInfo_Parms
{
	int                                                iMeshIndex;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bOutLineBloom : 1;                                		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                Red;                                              		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                Green;                                            		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                Blue;                                             		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                Alpha;                                            		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                iAlphaAnimType;                                   		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                iMinAlpha;                                        		// 0x001C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                iMaxAlpha;                                        		// 0x0020 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fAlphaAnimTime;                                   		// 0x0024 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fScale;                                           		// 0x0028 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fMinScale;                                        		// 0x002C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fMaxScale;                                        		// 0x0030 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function T1Game.T1CustomPawn.UpdatePolyHeight
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execUpdatePolyHeight_Parms
{
	float                                              fDeltaTime;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.SetVehicleAnimName
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetVehicleAnimName_Parms
{
	struct FString                                     strIdle;                                          		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                iSetType;                                         		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.SetMoveAnimRate
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetMoveAnimRate_Parms
{
	float                                              fRate;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.SetWalkRunCheckSpeed
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetWalkRunCheckSpeed_Parms
{
	float                                              fWalkSpeed;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fRunSpeed;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.SetHighJumpAnimName
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetHighJumpAnimName_Parms
{
	struct FString                                     strJumpStart;                                     		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strJumpIng;                                       		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strJumpEnd;                                       		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strJumpCancel;                                    		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.SetLongJumpAnimName
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetLongJumpAnimName_Parms
{
	struct FString                                     strJumpStart;                                     		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strJumpIng;                                       		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strJumpEnd;                                       		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strJumpCancel;                                    		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.GetChangeMoveAnimNamesFlag
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execGetChangeMoveAnimNamesFlag_Parms
{
	int                                                iUpper;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.SetChangeMoveAnimNamesFlag
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetChangeMoveAnimNamesFlag_Parms
{
	int                                                iUpper;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bFlag : 1;                                        		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.SetInterpolAnimName
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetInterpolAnimName_Parms
{
	struct FString                                     strJToI;                                          		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strJToMFront;                                     		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strJToMRight;                                     		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strJToMLeft;                                      		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strJToMBack;                                      		// 0x0030 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strMToJFront;                                     		// 0x003C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strMToJRight;                                     		// 0x0048 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strMToJLeft;                                      		// 0x0054 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strMtoI;                                          		// 0x0060 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strLtoR;                                          		// 0x006C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strRtoL;                                          		// 0x0078 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                iSetType;                                         		// 0x0084 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.SetCustomAnimName
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetCustomAnimName_Parms
{
	int                                                iUpper;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strCustom;                                        		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.SetIdleAnimName
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetIdleAnimName_Parms
{
	struct FString                                     strIdle;                                          		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                iSetType;                                         		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.SetJumpAnimName
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetJumpAnimName_Parms
{
	struct FString                                     strFront;                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strRight;                                         		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strLeft;                                          		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                iSetType;                                         		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.SetRunAnimName
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetRunAnimName_Parms
{
	struct FString                                     strFront;                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strRight;                                         		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strLeft;                                          		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strBack;                                          		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strRightBack;                                     		// 0x0030 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strLeftBack;                                      		// 0x003C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                iSetType;                                         		// 0x0048 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.SetWalkAnimName
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetWalkAnimName_Parms
{
	struct FString                                     strFront;                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strRight;                                         		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strLeft;                                          		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strBack;                                          		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strRightBack;                                     		// 0x0030 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strLeftBack;                                      		// 0x003C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                iSetType;                                         		// 0x0048 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.ApplyMeshCustomizeInfo
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execApplyMeshCustomizeInfo_Parms
{
	int                                                iMeshIndex;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.IsUseCustomizeDefaultType
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execIsUseCustomizeDefaultType_Parms
{
	int                                                Type;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function T1Game.T1CustomPawn.SetCustomizeDefaultType
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execSetCustomizeDefaultType_Parms
{
	int                                                Type;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUse : 1;                                         		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.PlayParticleMaterials
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execPlayParticleMaterials_Parms
{
};

// Function T1Game.T1CustomPawn.GetHitParticleMaterial
// [0x00420400] ( FUNC_Native )
struct AT1CustomPawn_execGetHitParticleMaterial_Parms
{
	TArray< class UParticleSystem* >                   InParticleMaterialArray;                          		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned char                                      InWeaponSize;                                     		// 0x000C (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function T1Game.T1CustomPawn.PlayPhysTempParticle
// [0x00020400] ( FUNC_Native )
struct AT1CustomPawn_execPlayPhysTempParticle_Parms
{
