#pragma once

/*
#############################################################################################
# Blade and Soul (25) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: T1Game_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
# Mentions: Ant.
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_DETACH_THROW_PAWN                                  0x01
#define CONST_DETACH_THROW_WITH_ROLL                             0x02
#define CONST_DETACH_THROW_STRAIGHT                              0x04
#define CONST_DETACH_FORCE_DETACH                                0x08
#define CONST_DETACH_NO_LOC_ROT_MOD_DETACH                       0x10
#define CONST_FLYATTACH_POSONLY                                  0x01
#define CONST_FLYATTACH_SYNCPOSWITHBONE                          0x02

// Enum T1Game.T1WayPointActor.T1WAYPOINTMOVETYPE
/*enum T1WAYPOINTMOVETYPE
{
	T1_WAYPOINT_TYPE_WALK                              = 0,
	T1_WAYPOINT_TYPE_RUN                               = 1,
	T1_WAYPOINT_TYPE_WARP                              = 2,
	T1_WAYPOINT_TYPE_MAX                               = 3
};*/

// Enum T1Game.T1ZoneProperty.T1ZONE_TYPE
/*enum T1ZONE_TYPE
{
	type_none                                          = 0,
	persistant                                         = 1,
	instant_pc                                         = 2,
	instant_party                                      = 3,
	instant_hybrid                                     = 4,
	dungeon                                            = 5,
	T1ZONE_TYPE_MAX                                    = 6
};*/

// Enum T1Game.T1ZoneProperty.T1ZONE_TYPE_NEW
/*enum T1ZONE_TYPE_NEW
{
	zone_type_none                                     = 0,
	zone_type_persistant                               = 1,
	zone_type_single                                   = 2,
	zone_type_instant                                  = 3,
	zone_type_dungeon                                  = 4,
	zone_type_arena                                    = 5,
	zone_type_single_dungeon                           = 6,
	zone_type_duel                                     = 7,
	zone_type_MAX                                      = 8
};*/

// Enum T1Game.T1ZoneProperty.T1ZONE_TYPE
/*enum T1ZONE_TYPE
{
	zone_type2_none                                    = 0,
	zone_type2_persistent                              = 1,
	zone_type2_single                                  = 2,
	zone_type2_instant                                 = 3,
	zone_type2_MAX                                     = 4
};*/

// Enum T1Game.T1ZoneProperty.T1Env_Link_EffectType
/*enum T1Env_Link_EffectType
{
	T1Env_LinkEffect_Persistant                        = 0,
	T1Env_LinkEffect_Single                            = 1,
	T1Env_LinkEffect_Instant                           = 2,
	T1Env_LinkEffect_ConflictArea                      = 3,
	T1Env_LinkEffect_Dungeon_WayIn                     = 4,
	T1Env_LinkEffect_Dungeon                           = 5,
	T1Env_LinkEffect_Blocked                           = 6,
	T1Env_LinkEffect_Single_normal                     = 7,
	T1Env_LinkEffect_Single_higher                     = 8,
	T1Env_LinkEffect_Single_veryhigher                 = 9,
	T1Env_LinkEffect_Single_hero                       = 10,
	T1Env_LinkEffect_Instant_normal                    = 11,
	T1Env_LinkEffect_Instant_higher                    = 12,
	T1Env_LinkEffect_Instant_veryhigher                = 13,
	T1Env_LinkEffect_raid_Dungeon                      = 14,
	T1Env_LinkEffect_MAX                               = 15
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class T1Game.T1EnvObjCylinderComponent
// 0x000C (0x022C - 0x0220)
class UT1EnvObjCylinderComponent : public UCylinderComponent
{
public:
	struct FVector                                     AreaExtent;                                       		// 0x0220 (0x000C) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3506 ];

		return pClassPointer;
	};

};

//UClass* UT1EnvObjCylinderComponent::pClassPointer = NULL;

// Class T1Game.T1EnvObjPortalCylinderComponent
// 0x000C (0x022C - 0x0220)
class UT1EnvObjPortalCylinderComponent : public UCylinderComponent
{
public:
	struct FVector                                     AreaExtent;                                       		// 0x0220 (0x000C) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3508 ];

		return pClassPointer;
	};

};

//UClass* UT1EnvObjPortalCylinderComponent::pClassPointer = NULL;

// Class T1Game.T1GameClient
// 0x0000 (0x023C - 0x023C)
class UT1GameClient : public UWindowsClient
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3510 ];

		return pClassPointer;
	};

};

//UClass* UT1GameClient::pClassPointer = NULL;

// Class T1Game.T1GameUIUExporter
// 0x0000 (0x0064 - 0x0064)
class UT1GameUIUExporter : public UExporter
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3512 ];

		return pClassPointer;
	};

};

//UClass* UT1GameUIUExporter::pClassPointer = NULL;

// Class T1Game.T1GameViewportClient
// 0x0004 (0x0114 - 0x0110)
class UT1GameViewportClient : public UGameViewportClient
{
public:
	unsigned long                                      m_bIsMouseMoving : 1;                             		// 0x0110 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3514 ];

		return pClassPointer;
	};

	void DrawTransition ( class UCanvas* Canvas );
	void eventPostRender ( class UCanvas* Canvas );
	bool eventInit ( struct FString* OutError );
	void PostRenderT1 ( class UCanvas* Canvas );
};

//UClass* UT1GameViewportClient::pClassPointer = NULL;

// Class T1Game.T1MapVolume
// 0x0060 (0x02B8 - 0x0258)
class AT1MapVolume : public AVolume
{
public:
	float                                              VolumeWidth;                                      		// 0x0258 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              VolumeHeight;                                     		// 0x025C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                DivCountHeight;                                   		// 0x0260 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                DivCountWidth;                                    		// 0x0264 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              SizeHeight;                                       		// 0x0268 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              SizeWidth;                                        		// 0x026C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     PackageName;                                      		// 0x0270 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      ImageSizeHeight;                                  		// 0x027C (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      ImageSizeWidth;                                   		// 0x027D (0x0001) [0x0000000000000001]              ( CPF_Edit )
	float                                              Width;                                            		// 0x0280 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ImageWidth;                                       		// 0x0284 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MapScale;                                         		// 0x0288 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      WorldMapFlag : 1;                                 		// 0x028C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      MiniMapFlag : 1;                                  		// 0x028C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	struct FString                                     Alias;                                            		// 0x0290 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     T1Description;                                    		// 0x029C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	int                                                VolumeID;                                         		// 0x02A8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  MapResource;                                      		// 0x02AC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   ImageOffset;                                      		// 0x02B0 (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3516 ];

		return pClassPointer;
	};

};

//UClass* AT1MapVolume::pClassPointer = NULL;

// Class T1Game.T1PlayerController
// 0x0058 (0x05F0 - 0x0598)
class AT1PlayerController : public APlayerController
{
public:
	float                                              fDestFreeCamDistance;                             		// 0x0598 (0x0004) [0x0000000000000000]              
	unsigned long                                      bNeedDollyInterp : 1;                             		// 0x059C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bIgnorePlayerRoation : 1;                         		// 0x059C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bInvalidateViewport : 1;                          		// 0x059C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bInvalidateViewportByMouse : 1;                   		// 0x059C (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bShowMyPC : 1;                                    		// 0x059C (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bCharacterFit_Enable : 1;                         		// 0x059C (0x0004) [0x0000000000004000] [0x00000020] ( CPF_Config )
	unsigned long                                      bCharacterFit_DOF : 1;                            		// 0x059C (0x0004) [0x0000000000004000] [0x00000040] ( CPF_Config )
	unsigned long                                      bCharacterShowMode : 1;                           		// 0x059C (0x0004) [0x0000000000002000] [0x00000080] ( CPF_Transient )
	float                                              DollyFactor;                                      		// 0x05A0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              StopTime;                                         		// 0x05A4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              fCharacterFit_Distance;                           		// 0x05A8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              fCharacterFit_Boundary;                           		// 0x05AC (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              fCharacterFit_StatusBoundary;                     		// 0x05B0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              fCharacterFit_InterpTime;                         		// 0x05B4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              fCharacterFit_InterpSpeed;                        		// 0x05B8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              fCharacterFit_DollyFactor;                        		// 0x05BC (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              fCharacterFit_ExtendHeight;                       		// 0x05C0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              fCharacterFit_ExtendSize;                         		// 0x05C4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              fCharacterFit_ExtendDepth_All;                    		// 0x05C8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              fCharacterFit_ExtendDepth_Half;                   		// 0x05CC (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              fCharacterFit_ExtendDepth_Face;                   		// 0x05D0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                iCharacterFit_Pitch_All;                          		// 0x05D4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                iCharacterFit_Pitch_Half;                         		// 0x05D8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                iCharacterFit_Pitch_Face;                         		// 0x05DC (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                iCharacterFit_Yaw_AllowDegree;                    		// 0x05E0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned char                                      CharacterFit_Status;                              		// 0x05E4 (0x0001) [0x0000000000000000]              
	float                                              fCharacterFit_StatusPosition;                     		// 0x05E8 (0x0004) [0x0000000000000000]              
	float                                              fCharacterFit_Interp;                             		// 0x05EC (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3518 ];

		return pClassPointer;
	};

	void AlignPlayerPawnToCameraDirection ( );
	void eventCameraMove ( float Duration, float Pct, struct FRawDistributionVector* newRotAdjust, struct FRawDistributionVector* newLocAdjust, struct FRawDistributionFloat* newFovAdjust );
	void eventCameraShake ( float Duration, struct FVector newRotAmplitude, struct FVector newRotFrequency, struct FVector newLocAmplitude, struct FVector newLocFrequency, float newFOVAmplitude, float newFOVFrequency, unsigned long bRotRandom, unsigned long bLocRandom, unsigned long bFOVRandom );
	void PlayerMove ( float DeltaTime );
	void CheckJumpOrDuck ( );
	void PlayerTick ( float DeltaTime );
	void ProcessViewRotation ( float DeltaTime, struct FRotator DeltaRot, struct FRotator* out_ViewRotation );
	void UpdateRotation ( float DeltaTime );
	void ShoulderPosCamDist ( float fDist );
	void ShoulderPosY ( float fY );
	void ShoulderPosX ( float fX );
	void ShoulderPos ( float fX, float fY, float fDist );
	void TargetZoom ( float fTargetZoom );
	void TargetRot ( float fPitch, float fYaw );
	void SetCamTargetHeightNear ( float fHeight );
	void CamTargetHeightNearDown ( );
	void CamTargetHeightNearUp ( );
	void SetCamTargetHeight ( float fHeight );
	void CamTargetHeightDown ( );
	void CamTargetHeightUp ( );
	void SetCharacterShowMode ( unsigned long bFlag );
	struct FVector NativeAccel ( struct FVector X, struct FVector Y, struct FVector Z );
	void ToggleCamInfo ( );
	void SetFovAtMax ( float FOV );
	void SetFovAtZero ( float FOV );
	void SetCamNearDist ( float fDist );
	void SetCamMaxDist ( float fDist );
	void SetCamMinDist ( float fDist );
	void SetCamHeightTransDist ( float fDist );
	void SetDollyFactor ( float fNewDollyFactor );
	void Dolly ( float fDollyFactor );
	bool CharacterFitDolly ( float fDollyFactor );
	void DollyOut ( );
	void DollyIn ( );
	void Face ( int a_Type );
	void Hair ( int a_Type );
	void Costume ( int a_Type );
	void ChangeSet ( int a_Type );
	void execAttackReq ( );
};

//UClass* AT1PlayerController::pClassPointer = NULL;

// Class T1Game.T1PlayerInput
// 0x0028 (0x01F0 - 0x01C8)
class UT1PlayerInput : public UPlayerInput
{
public:
	unsigned char                                      bInputMove;                                       		// 0x01C8 (0x0001) [0x0000000000000000]              
	unsigned char                                      bInputRotate;                                     		// 0x01C9 (0x0001) [0x0000000000000000]              
	unsigned char                                      bInitialCameraBlend;                              		// 0x01CA (0x0001) [0x0000000000000000]              
	unsigned char                                      bBlockInputRotation;                              		// 0x01CB (0x0001) [0x0000000000000000]              
	unsigned char                                      bRotateTypeForJoypad;                             		// 0x01CC (0x0001) [0x0000000000000004]              ( CPF_Input )
	unsigned char                                      bRotatePlayer;                                    		// 0x01CD (0x0001) [0x0000000000000004]              ( CPF_Input )
	unsigned char                                      bRotateCamOnly;                                   		// 0x01CE (0x0001) [0x0000000000000004]              ( CPF_Input )
	unsigned char                                      bForceRotatePlayer;                               		// 0x01CF (0x0001) [0x0000000000000000]              
	unsigned char                                      bLeftShift;                                       		// 0x01D0 (0x0001) [0x0000000000000004]              ( CPF_Input )
	unsigned char                                      TPSInnerMode;                                     		// 0x01D1 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	unsigned char                                      bTPSRotateCamOnly;                                		// 0x01D2 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	unsigned char                                      bTPSRotatePlayer;                                 		// 0x01D3 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      m_bResetCamera : 1;                               		// 0x01D4 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bTurnPlayer : 1;                                  		// 0x01D4 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bTurnDirection : 1;                               		// 0x01D4 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bUseTPSMode : 1;                                  		// 0x01D4 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
	unsigned long                                      bForceTPSUIMode : 1;                              		// 0x01D4 (0x0004) [0x0000000000002000] [0x00000010] ( CPF_Transient )
	unsigned long                                      bUseTPSHybridMode : 1;                            		// 0x01D4 (0x0004) [0x0000000000002000] [0x00000020] ( CPF_Transient )
	unsigned long                                      bTPSHybridRotate : 1;                             		// 0x01D4 (0x0004) [0x0000000000002000] [0x00000040] ( CPF_Transient )
	unsigned long                                      bTPSCursorOutSideWindow : 1;                      		// 0x01D4 (0x0004) [0x0000000000002000] [0x00000080] ( CPF_Transient )
	unsigned long                                      bTPSLostFocus : 1;                                		// 0x01D4 (0x0004) [0x0000000000002000] [0x00000100] ( CPF_Transient )
	unsigned long                                      bUseTPSRotateCamToggle : 1;                       		// 0x01D4 (0x0004) [0x0000000000002000] [0x00000200] ( CPF_Transient )
	unsigned long                                      bTPSRotateCamToggleFlag : 1;                      		// 0x01D4 (0x0004) [0x0000000000002000] [0x00000400] ( CPF_Transient )
	unsigned long                                      bTPSRotateCamResetToDefault : 1;                  		// 0x01D4 (0x0004) [0x0000000000002000] [0x00000800] ( CPF_Transient )
	unsigned long                                      bMustReleaseTPSContextKey : 1;                    		// 0x01D4 (0x0004) [0x0000000000002000] [0x00001000] ( CPF_Transient )
	unsigned long                                      bPushTPSContextKeyL : 1;                          		// 0x01D4 (0x0004) [0x0000000000002000] [0x00002000] ( CPF_Transient )
	unsigned long                                      bPushTPSContextKeyR : 1;                          		// 0x01D4 (0x0004) [0x0000000000002000] [0x00004000] ( CPF_Transient )
	unsigned long                                      bPushTPSContextKeyM : 1;                          		// 0x01D4 (0x0004) [0x0000000000002000] [0x00008000] ( CPF_Transient )
	float                                              aTurnKeyboard;                                    		// 0x01D8 (0x0004) [0x0000000000000004]              ( CPF_Input )
	float                                              m_fStrafe;                                        		// 0x01DC (0x0004) [0x0000000000000000]              
	float                                              aPreMouseX;                                       		// 0x01E0 (0x0004) [0x0000000000000000]              
	float                                              aPreMouseY;                                       		// 0x01E4 (0x0004) [0x0000000000000000]              
	float                                              aTPSMouseMoveX;                                   		// 0x01E8 (0x0004) [0x0000000000000000]              
	float                                              aTPSMouseMoveY;                                   		// 0x01EC (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3520 ];

		return pClassPointer;
	};

	void ToggleRotateTypeForJoypad ( );
	void DisableRotateForJoypad ( );
	void EnableRotateForJoypad ( );
	void ToggleKeepWalking ( );
	void QuickTurn ( );
	void ResetCamera ( );
	void GlideDrop ( );
	void UnDash ( );
	void Dash ( );
	void SetTPSInnerMode ( unsigned char InMode );
	bool IsRotateCamOnly ( );
	bool IsRotatePlayer ( );
	void eventPlayerInput ( float DeltaTime );
};

//UClass* UT1PlayerInput::pClassPointer = NULL;

// Class T1Game.T1PlayerStart
// 0x0001 (0x0305 - 0x0304)
class AT1PlayerStart : public APlayerStart
{
public:
	unsigned char                                      m_CharType;                                       		// 0x0304 (0x0001) [0x0000000000000002]              ( CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3522 ];

		return pClassPointer;
	};

};

//UClass* AT1PlayerStart::pClassPointer = NULL;

// Class T1Game.T1SceneCaptureMapVolumeActor
// 0x0004 (0x0218 - 0x0214)
class AT1SceneCaptureMapVolumeActor : public ASceneCaptureActor
{
public:
	class UTextureRenderTarget2D*                      renderTarget;                                     		// 0x0214 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3524 ];

		return pClassPointer;
	};

	bool GetRenderedResult ( class UTexture2D* ResultTexture );
};

//UClass* AT1SceneCaptureMapVolumeActor::pClassPointer = NULL;

// Class T1Game.T1SceneCaptureMapVolumeComponent
// 0x00A0 (0x0120 - 0x0080)
class UT1SceneCaptureMapVolumeComponent : public USceneCaptureComponent
{
public:
	class UTextureRenderTarget2D*                      TextureTarget;                                    		// 0x0080 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FBox                                        ViewVolume;                                       		// 0x0084 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	struct FMatrix                                     ViewMatrix;                                       		// 0x00A0 (0x0040) [0x0000000000002000]              ( CPF_Transient )
	struct FMatrix                                     ProjMatrix;                                       		// 0x00E0 (0x0040) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3526 ];

		return pClassPointer;
	};

};

//UClass* UT1SceneCaptureMapVolumeComponent::pClassPointer = NULL;

// Class T1Game.T1TerrainProperty
// 0x0044 (0x0254 - 0x0210)
class AT1TerrainProperty : public AActor
{
public:
	int                                                Id;                                               		// 0x0210 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     Alias;                                            		// 0x0214 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     TerrainMapName;                                   		// 0x0220 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     T1Description;                                    		// 0x022C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	int                                                OrginX;                                           		// 0x0238 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                OrginY;                                           		// 0x023C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                CountX;                                           		// 0x0240 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                CountY;                                           		// 0x0244 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                World_Origin_X;                                   		// 0x0248 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                World_Origin_Y;                                   		// 0x024C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      ShowTerrainGridSimply : 1;                        		// 0x0250 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      ShowZoneGridSimply : 1;                           		// 0x0250 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      ShowSelectedZoneOnly : 1;                         		// 0x0250 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      ShowSelectedZoneObject : 1;                       		// 0x0250 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3528 ];

		return pClassPointer;
	};

};

//UClass* AT1TerrainProperty::pClassPointer = NULL;

// Class T1Game.T1TerrainViewer
// 0x0004 (0x0214 - 0x0210)
class AT1TerrainViewer : public AActor
{
public:
	class UStaticMeshComponent*                        PlaneMeshComponent;                               		// 0x0210 (0x0004) [0x0000000000000008]              ( CPF_ExportObject )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3530 ];

		return pClassPointer;
	};

};

//UClass* AT1TerrainViewer::pClassPointer = NULL;

// Class T1Game.T1ZoneProperty
// 0x0258 (0x0468 - 0x0210)
class AT1ZoneProperty : public AActor
{
public:
	unsigned char                                      nType;                                            		// 0x0210 (0x0001) [0x0000000000000000]              
	unsigned char                                      ZonePropType;                                     		// 0x0211 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      ZoneType2;                                        		// 0x0212 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      LinkZoneEffectType;                               		// 0x0213 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	int                                                Id;                                               		// 0x0214 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     Alias;                                            		// 0x0218 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	int                                                TerrainID;                                        		// 0x0224 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     AI_ID;                                            		// 0x0228 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     KismetName;                                       		// 0x0234 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     KismetName01;                                     		// 0x0240 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     T1Description;                                    		// 0x024C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     reentrance_pcspawn;                               		// 0x0258 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     reentrance_pcspawn_in_arena;                      		// 0x0264 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	int                                                OrginX;                                           		// 0x0270 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                OrginY;                                           		// 0x0274 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                CountX;                                           		// 0x0278 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                CountY;                                           		// 0x027C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                PCMax;                                            		// 0x0280 (0x0004) [0x0000000000000000]              
	int                                                NPCMax;                                           		// 0x0284 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                nXYCubeSize;                                      		// 0x0288 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ZoneDomain_Id;                                    		// 0x028C (0x0004) [0x0000000000000000]              
	int                                                MinChannelCount;                                  		// 0x0290 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ReCommend_PC_Count;                               		// 0x0294 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      Recharge_exp_Boost : 1;                           		// 0x0298 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      EnableGhostMode : 1;                              		// 0x0298 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      TutorialZone : 1;                                 		// 0x0298 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      sharable_combatmode : 1;                          		// 0x0298 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      ZoneSight_Cube : 1;                               		// 0x0298 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      available_sextet_party : 1;                       		// 0x0298 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      WriteEquipinfoLog : 1;                            		// 0x0298 (0x0004) [0x0000000000000001] [0x00000040] ( CPF_Edit )
	unsigned long                                      DeprecatedZone : 1;                               		// 0x0298 (0x0004) [0x0000000000000001] [0x00000080] ( CPF_Edit )
	unsigned long                                      ArenaEntrance : 1;                                		// 0x0298 (0x0004) [0x0000000000000001] [0x00000100] ( CPF_Edit )
	unsigned long                                      LightClientEnable : 1;                            		// 0x0298 (0x0004) [0x0000000000000001] [0x00000200] ( CPF_Edit )
	unsigned long                                      DefaultPhaseZone : 1;                             		// 0x0298 (0x0004) [0x0000000000000001] [0x00000400] ( CPF_Edit )
	int                                                ZoneGroupId;                                      		// 0x029C (0x0004) [0x0000000000000000]              
	float                                              Close_Interval;                                   		// 0x02A0 (0x0004) [0x0000000000000000]              
	struct FT1_RESPAWN_AREA_INZONE                     RespawnAreaInfo;                                  		// 0x02A4 (0x0014) [0x0000000000000001]              ( CPF_Edit )
	struct FT1_BASECAMP_AREA_INZONE                    BaseCampAreaInfo;                                 		// 0x02B8 (0x0014) [0x0000000000000001]              ( CPF_Edit )
	int                                                ChannelCount;                                     		// 0x02CC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     ZoneRefMapinfo;                                   		// 0x02D0 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     ZoneRefDiscoverinfo;                              		// 0x02DC (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              FallDeathHeight;                                  		// 0x02E8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     DefPhaseSpawnId;                                  		// 0x02EC (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     DefDungeonTable;                                  		// 0x02F8 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     RefTableData;                                     		// 0x0304 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     RefTableData01;                                   		// 0x0310 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     RefTableData02;                                   		// 0x031C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FT1_ZONEPROP_ARENA_RETURN_INFO              ArenaInfo[ 0x2 ];                                 		// 0x0328 (0x0030) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     ArenaRefEnterSocial;                              		// 0x0358 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     ArenaRefLeaveSocial;                              		// 0x0364 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     ArenaRefEnterCinematic[ 0x2 ];                    		// 0x0370 (0x0018) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     ArenaRefLeaveCinematic[ 0x2 ];                    		// 0x0388 (0x0018) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     TransferPcspawnByDeprecated;                      		// 0x03A0 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	int                                                Arena_faction_diff;                               		// 0x03AC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                DownLoadLevel;                                    		// 0x03B0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     phase_zone[ 0xB ];                                		// 0x03B4 (0x0084) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     RespawnByActivatedFactionRequiredFaction[ 0x2 ];  		// 0x0438 (0x0018) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     RespawnByActivatedFaction[ 0x2 ];                 		// 0x0450 (0x0018) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3532 ];

		return pClassPointer;
	};

};

//UClass* AT1ZoneProperty::pClassPointer = NULL;

// Class T1Game.T1CustomPawn
// 0x1824 (0x1E70 - 0x064C)
class AT1CustomPawn : public APawn
{
public:
	class UAudioTrack*                                 VoiceAudioTrack;                                  		// 0x064C (0x0004) [0x0000000000000008]              ( CPF_ExportObject )
	struct FVector                                     LandBounceDestination;                            		// 0x0650 (0x000C) [0x0000000000000000]              
	struct FDouble                                     CustomVelocityStartTime;                          		// 0x065C (0x0008) [0x0000000000000000]              
	struct FDouble                                     CustomVelocityEndTime;                            		// 0x0664 (0x0008) [0x0000000000000000]              
	float                                              CustomVelocityDistance;                           		// 0x066C (0x0004) [0x0000000000000000]              
	float                                              CustomVelocityVelocityPerSec;                     		// 0x0670 (0x0004) [0x0000000000000000]              
	float                                              ThrowStartMultiplier;                             		// 0x0674 (0x0004) [0x0000000000000000]              
	TArray< struct FPawnThrowElement >                 PawnThrowSequence;                                		// 0x0678 (0x000C) [0x0000000000000000]              
	class AT1CustomPawn*                               PawnAttachedTo;                                   		// 0x0684 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bRequirePawnReattach : 1;                         		// 0x0688 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bRequireParticleRepositioning : 1;                		// 0x0688 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bThrown : 1;                                      		// 0x0688 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bUpdateCDTCount : 1;                              		// 0x0688 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
	unsigned long                                      bEnableGuildPreview : 1;                          		// 0x0688 (0x0004) [0x0000000000002000] [0x00000010] ( CPF_Transient )
	unsigned long                                      bForceUpdateGuildProp : 1;                        		// 0x0688 (0x0004) [0x0000000000002000] [0x00000020] ( CPF_Transient )
	unsigned long                                      bForceApplyGuildPropAll : 1;                      		// 0x0688 (0x0004) [0x0000000000002000] [0x00000040] ( CPF_Transient )
	unsigned long                                      bLocalFaceAnimFlag : 1;                           		// 0x0688 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      bAutoPhysics : 1;                                 		// 0x0688 (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      bFaceAimOn : 1;                                   		// 0x0688 (0x0004) [0x0000000000002000] [0x00000200] ( CPF_Transient )
	unsigned long                                      bLookRandAimOn : 1;                               		// 0x0688 (0x0004) [0x0000000000002000] [0x00000400] ( CPF_Transient )
	unsigned long                                      bForceCircleShadow : 1;                           		// 0x0688 (0x0004) [0x0000000000002000] [0x00000800] ( CPF_Transient )
	unsigned long                                      bDynamicShadowOff : 1;                            		// 0x0688 (0x0004) [0x0000000000002000] [0x00001000] ( CPF_Transient )
	unsigned long                                      bCalcFootLoc : 1;                                 		// 0x0688 (0x0004) [0x0000000000002000] [0x00002000] ( CPF_Transient )
	unsigned long                                      bChangeCheckFootPos : 1;                          		// 0x0688 (0x0004) [0x0000000000002000] [0x00004000] ( CPF_Transient )
	unsigned long                                      bAbsApplyPolyHeight : 1;                          		// 0x0688 (0x0004) [0x0000000000002000] [0x00008000] ( CPF_Transient )
	unsigned long                                      bAccumulateFlag : 1;                              		// 0x0688 (0x0004) [0x0000000000002000] [0x00010000] ( CPF_Transient )
	unsigned long                                      bCheckSitdown : 1;                                		// 0x0688 (0x0004) [0x0000000000002000] [0x00020000] ( CPF_Transient )
	unsigned long                                      bCheckHeightLock : 1;                             		// 0x0688 (0x0004) [0x0000000000002000] [0x00040000] ( CPF_Transient )
	unsigned long                                      bFirstSpawn : 1;                                  		// 0x0688 (0x0004) [0x0000000000002000] [0x00080000] ( CPF_Transient )
	unsigned long                                      bPreFootCheck : 1;                                		// 0x0688 (0x0004) [0x0000000000002000] [0x00100000] ( CPF_Transient )
	unsigned long                                      bPreEnablePolyHeight : 1;                         		// 0x0688 (0x0004) [0x0000000000002000] [0x00200000] ( CPF_Transient )
	unsigned long                                      bEnableOtherHeight : 1;                           		// 0x0688 (0x0004) [0x0000000000002000] [0x00400000] ( CPF_Transient )
	unsigned long                                      bCenterLineCheckIsNull : 1;                       		// 0x0688 (0x0004) [0x0000000000002000] [0x00800000] ( CPF_Transient )
	unsigned long                                      EnablePolyHeight : 1;                             		// 0x0688 (0x0004) [0x0000000000003000] [0x01000000] ( CPF_Native | CPF_Transient )
	unsigned long                                      bIgnoreFootPlacement : 1;                         		// 0x0688 (0x0004) [0x0000000000003000] [0x02000000] ( CPF_Native | CPF_Transient )
	unsigned long                                      bMoveInterp : 1;                                  		// 0x0688 (0x0004) [0x0000000000002000] [0x04000000] ( CPF_Transient )
	unsigned long                                      bMoveInterpReset : 1;                             		// 0x0688 (0x0004) [0x0000000000002000] [0x08000000] ( CPF_Transient )
	unsigned long                                      bMoveInterpCylinderTick : 1;                      		// 0x0688 (0x0004) [0x0000000000002000] [0x10000000] ( CPF_Transient )
	unsigned long                                      bMoveInterpMeshTick : 1;                          		// 0x0688 (0x0004) [0x0000000000002000] [0x20000000] ( CPF_Transient )
	unsigned long                                      bEnableFallingPolyHeight : 1;                     		// 0x0688 (0x0004) [0x0000000000002000] [0x40000000] ( CPF_Transient )
	unsigned long                                      bIgnoreDistanceOptimize : 1;                      		// 0x0688 (0x0004) [0x0000000000002000] [0x80000000] ( CPF_Transient )
	unsigned long                                      bPawnFadeIn : 1;                                  		// 0x068C (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bFainting : 1;                                    		// 0x068C (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      bDisappearfromView : 1;                           		// 0x068C (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      bDependencyParticleHide : 1;                      		// 0x068C (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
	unsigned long                                      bChangeMoveAnimNamesPet : 1;                      		// 0x068C (0x0004) [0x0000000000002000] [0x00000010] ( CPF_Transient )
	unsigned long                                      bChangeMoveAnimNamesUpper : 1;                    		// 0x068C (0x0004) [0x0000000000002000] [0x00000020] ( CPF_Transient )
	unsigned long                                      bChangeMoveAnimNamesLower : 1;                    		// 0x068C (0x0004) [0x0000000000002000] [0x00000040] ( CPF_Transient )
	unsigned long                                      bSetCurrentRunWalkSpeed : 1;                      		// 0x068C (0x0004) [0x0000000000002000] [0x00000080] ( CPF_Transient )
	unsigned long                                      bSetCurrentMoveAnimRate : 1;                      		// 0x068C (0x0004) [0x0000000000002000] [0x00000100] ( CPF_Transient )
	unsigned long                                      bSkipUpdateSound : 1;                             		// 0x068C (0x0004) [0x0000000000002000] [0x00000200] ( CPF_Transient )
	unsigned long                                      bKismetAnimOnlyMode : 1;                          		// 0x068C (0x0004) [0x0000000000002000] [0x00000400] ( CPF_Transient )
	unsigned long                                      bKismetUsingForCustomPawn : 1;                    		// 0x068C (0x0004) [0x0000000000002000] [0x00000800] ( CPF_Transient )
	unsigned long                                      bKismetPlayed : 1;                                		// 0x068C (0x0004) [0x0000000000002000] [0x00001000] ( CPF_Transient )
	unsigned long                                      bAddDelayReleasedList : 1;                        		// 0x068C (0x0004) [0x0000000000002000] [0x00002000] ( CPF_Transient )
	unsigned long                                      bNotCulledTicking : 1;                            		// 0x068C (0x0004) [0x0000000000002000] [0x00004000] ( CPF_Transient )
	unsigned long                                      bVisibleFootPrint : 1;                            		// 0x068C (0x0004) [0x0000000000002000] [0x00008000] ( CPF_Transient )
	unsigned long                                      bVisibleWaterPrint : 1;                           		// 0x068C (0x0004) [0x0000000000002000] [0x00010000] ( CPF_Transient )
	unsigned long                                      Driving : 1;                                      		// 0x068C (0x0004) [0x0000000000000000] [0x00020000] 
	unsigned long                                      bBlockMoveAnim : 1;                               		// 0x068C (0x0004) [0x0000000000002000] [0x00040000] ( CPF_Transient )
	unsigned long                                      bPlayCameraSetting : 1;                           		// 0x068C (0x0004) [0x0000000000002000] [0x00080000] ( CPF_Transient )
	unsigned long                                      bPauseCustomAnim : 1;                             		// 0x068C (0x0004) [0x0000000000002000] [0x00100000] ( CPF_Transient )
	unsigned long                                      bIgnoreFootAimControl : 1;                        		// 0x068C (0x0004) [0x0000000000002000] [0x00200000] ( CPF_Transient )
	unsigned long                                      bUseSlopeRotation : 1;                            		// 0x068C (0x0004) [0x0000000000002000] [0x00400000] ( CPF_Transient )
	unsigned long                                      bIgnoreAimControl : 1;                            		// 0x068C (0x0004) [0x0000000000002000] [0x00800000] ( CPF_Transient )
	unsigned long                                      bPreviousSocketPlacement : 1;                     		// 0x068C (0x0004) [0x0000000000002000] [0x01000000] ( CPF_Transient )
	unsigned long                                      bUseHandToSocketPlacement : 1;                    		// 0x068C (0x0004) [0x0000000000002000] [0x02000000] ( CPF_Transient )
	unsigned long                                      bIgnoreCustomAniWeaponC : 1;                      		// 0x068C (0x0004) [0x0000000000002000] [0x04000000] ( CPF_Transient )
	unsigned long                                      FlyingAttachPosOnly : 1;                          		// 0x068C (0x0004) [0x0000000000002000] [0x08000000] ( CPF_Transient )
	unsigned long                                      FlyingIdleBlendMode : 1;                          		// 0x068C (0x0004) [0x0000000000002000] [0x10000000] ( CPF_Transient )
	unsigned long                                      FlyingIgnoreGravity : 1;                          		// 0x068C (0x0004) [0x0000000000002000] [0x20000000] ( CPF_Transient )
	unsigned long                                      bPreventSpawnFallApplied : 1;                     		// 0x068C (0x0004) [0x0000000000002000] [0x40000000] ( CPF_Transient )
	unsigned long                                      bSpawned : 1;                                     		// 0x068C (0x0004) [0x0000000000002000] [0x80000000] ( CPF_Transient )
	unsigned long                                      bPet : 1;                                         		// 0x0690 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bPetSelfTicked : 1;                               		// 0x0690 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      bResetPhysicsThisFrame : 1;                       		// 0x0690 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      bApplyChangeAnimImmediate : 1;                    		// 0x0690 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
	unsigned long                                      bUpdatedOldLocation : 1;                          		// 0x0690 (0x0004) [0x0000000000002000] [0x00000010] ( CPF_Transient )
	unsigned long                                      bAllowPolyheightUpdate : 1;                       		// 0x0690 (0x0004) [0x0000000000002000] [0x00000020] ( CPF_Transient )
	TArray< struct FPawnAttachInfo >                   PawnAttached;                                     		// 0x0694 (0x000C) [0x0000000000000000]              
	float                                              ParticleRepositioningBlendTime;                   		// 0x06A0 (0x0004) [0x0000000000000000]              
	TArray< struct FParticleAttachInfo >               ParticleAttachInfos;                              		// 0x06A4 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FName >                             ParticleAttachUsableBones;                        		// 0x06B0 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	float                                              ThrowTotalTime;                                   		// 0x06BC (0x0004) [0x0000000000000000]              
	float                                              CurrentThrowTime;                                 		// 0x06C0 (0x0004) [0x0000000000000000]              
	struct FVector                                     ThrowStartPosition;                               		// 0x06C4 (0x000C) [0x0000000000000000]              
	struct FVector                                     ThrowFixedYAxis;                                  		// 0x06D0 (0x000C) [0x0000000000000000]              
	float                                              ThrowInitialRotationTime;                         		// 0x06DC (0x0004) [0x0000000000000000]              
	float                                              CurrentThrowRotationTime;                         		// 0x06E0 (0x0004) [0x0000000000000000]              
	float                                              LandAnimationStartTime;                           		// 0x06E4 (0x0004) [0x0000000000000000]              
	float                                              CurrentLandPhysicsWeightBlendTime;                		// 0x06E8 (0x0004) [0x0000000000000000]              
	struct FRotator                                    ThrowLandingRotation;                             		// 0x06EC (0x000C) [0x0000000000000000]              
	struct FRotator                                    ThrowForceRotation;                               		// 0x06F8 (0x000C) [0x0000000000000000]              
	struct FName                                       PutDownEndAnimName;                               		// 0x0704 (0x0008) [0x0000000000000000]              
	class UPhysicsAsset*                               CommonPhysicsAsset;                               		// 0x070C (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UPhysicsAssetInstance*                       CommonPhysicsAssetInstance;                       		// 0x0710 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	TArray< class UAnimNotify* >                       TickedAnimNotifies;                               		// 0x0714 (0x000C) [0x0000000000000000]              
	TArray< struct FGroundParticleInfo >               ActiveGroundParticles;                            		// 0x0720 (0x000C) [0x0000000000000000]              
	TArray< struct FDelayParticleInfo >                ReservedDelayParticles;                           		// 0x072C (0x000C) [0x0000000000000000]              
	struct FSkeletalInfo                               MeshInfo[ 0x1C ];                                 		// 0x0738 (0x0E00) [0x0000000000000000]              
	int                                                UseCustomizeDefaultTypeCount[ 0x4 ];              		// 0x1538 (0x0010) [0x0000000000002000]              ( CPF_Transient )
	struct FT1PawnCustomizeInfo                        PawnCustomizeInfo;                                		// 0x1548 (0x022C) [0x0000000000000000]              
	struct Fsqword                                     JoinGuildKey;                                     		// 0x1774 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	int                                                GuildCustomMeshType[ 0x4 ];                       		// 0x177C (0x0010) [0x0000000000002000]              ( CPF_Transient )
	int                                                GuildPropDirtyCount;                              		// 0x178C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FName                                       FacialAnimName;                                   		// 0x1790 (0x0008) [0x0000000000000000]              
	struct FSoundNotiType                              PawnSoundType;                                    		// 0x1798 (0x0008) [0x0000000000000000]              
	struct FVector                                     OldRotation;                                      		// 0x17A0 (0x000C) [0x0000000000000000]              
	struct FVector                                     OldAimRotation;                                   		// 0x17AC (0x000C) [0x0000000000002000]              ( CPF_Transient )
	class UAudioComponent*                             FacialAudioComp;                                  		// 0x17B8 (0x0004) [0x0000000000000008]              ( CPF_ExportObject )
	float                                              fWarpedTime;                                      		// 0x17BC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              fPolyHeight;                                      		// 0x17C0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     vecPolyRotation;                                  		// 0x17C4 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     vecBeforePolyRotWeight;                           		// 0x17D0 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	float                                              fPolyRotationInterpol;                            		// 0x17DC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              fPolyRotationBlendTime;                           		// 0x17E0 (0x0004) [0x0000000000004000]              ( CPF_Config )
