#pragma once

/*
#############################################################################################
# Blade and Soul (25) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: UnrealEd_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
# Mentions: Ant.
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_AUTOEXPAND_VALUE                                   0

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum UnrealEd.ThumbnailManager.EThumbnailPrimType
/*enum EThumbnailPrimType
{
	TPT_None                                           = 0,
	TPT_Sphere                                         = 1,
	TPT_Cube                                           = 2,
	TPT_Plane                                          = 3,
	TPT_Cylinder                                       = 4,
	TPT_MAX                                            = 5
};*/

// Enum UnrealEd.ThumbnailManager.EThumbnailBackgroundType
/*enum EThumbnailBackgroundType
{
	TBT_None                                           = 0,
	TBT_DefaultBackground                              = 1,
	TBT_SolidBackground                                = 2,
	TBT_MAX                                            = 3
};*/

// Enum UnrealEd.TopRenderVolumeActor.TOPRENDERVOLUME_IMAGE_SIZE
/*enum TOPRENDERVOLUME_IMAGE_SIZE
{
	TRV_IMG_SIZE                                       = 0,
	TRV_IMG_SIZE01                                     = 1,
	TRV_IMG_SIZE02                                     = 2,
	TRV_IMG_SIZE03                                     = 3,
	TRV_IMG_SIZE04                                     = 4,
	TRV_IMG_SIZE05                                     = 5,
	TRV_IMG_SIZE06                                     = 6,
	TRV_IMG_SIZE07                                     = 7,
	TRV_IMG_SIZE_MAX                                   = 8
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class UnrealEd.AnimNodeEditInfo
// 0x0004 (0x0040 - 0x003C)
class UAnimNodeEditInfo : public UObject
{
public:
	class UClass*                                      AnimNodeClass;                                    		// 0x003C (0x0004) [0x0000000000000002]              ( CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3123 ];

		return pClassPointer;
	};

};

//UClass* UAnimNodeEditInfo::pClassPointer = NULL;

// Class UnrealEd.AnimNodeEditInfo_AimOffset
// 0x0008 (0x0048 - 0x0040)
class UAnimNodeEditInfo_AimOffset : public UAnimNodeEditInfo
{
public:
	struct FPointer                                    EditWindow;                                       		// 0x0040 (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	class UAnimNodeAimOffset*                          EditNode;                                         		// 0x0044 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3125 ];

		return pClassPointer;
	};

};

//UClass* UAnimNodeEditInfo_AimOffset::pClassPointer = NULL;

// Class UnrealEd.ThumbnailLabelRenderer
// 0x0000 (0x003C - 0x003C)
class UThumbnailLabelRenderer : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3127 ];

		return pClassPointer;
	};

};

//UClass* UThumbnailLabelRenderer::pClassPointer = NULL;

// Class UnrealEd.AnimSetLabelRenderer
// 0x0000 (0x003C - 0x003C)
class UAnimSetLabelRenderer : public UThumbnailLabelRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3129 ];

		return pClassPointer;
	};

};

//UClass* UAnimSetLabelRenderer::pClassPointer = NULL;

// Class UnrealEd.AnimTreeEdSkelComponent
// 0x0004 (0x155C - 0x1558)
class UAnimTreeEdSkelComponent : public USkeletalMeshComponent
{
public:
	struct FPointer                                    AnimTreeEdPtr;                                    		// 0x1558 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3131 ];

		return pClassPointer;
	};

};

//UClass* UAnimTreeEdSkelComponent::pClassPointer = NULL;

// Class UnrealEd.AnimTreeLabelRenderer
// 0x0000 (0x003C - 0x003C)
class UAnimTreeLabelRenderer : public UThumbnailLabelRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3133 ];

		return pClassPointer;
	};

};

//UClass* UAnimTreeLabelRenderer::pClassPointer = NULL;

// Class UnrealEd.ThumbnailRenderer
// 0x0000 (0x003C - 0x003C)
class UThumbnailRenderer : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3135 ];

		return pClassPointer;
	};

};

//UClass* UThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.IconThumbnailRenderer
// 0x0010 (0x004C - 0x003C)
class UIconThumbnailRenderer : public UThumbnailRenderer
{
public:
	struct FString                                     IconName;                                         		// 0x003C (0x000C) [0x0000000000000000]              
	class UTexture2D*                                  Icon;                                             		// 0x0048 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3137 ];

		return pClassPointer;
	};

};

//UClass* UIconThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.ArchetypeThumbnailRenderer
// 0x0000 (0x004C - 0x004C)
class UArchetypeThumbnailRenderer : public UIconThumbnailRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3139 ];

		return pClassPointer;
	};

};

//UClass* UArchetypeThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.ASVSkelComponent
// 0x000C (0x1564 - 0x1558)
class UASVSkelComponent : public USkeletalMeshComponent
{
public:
	struct FPointer                                    AnimSetViewerPtr;                                 		// 0x1558 (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	unsigned long                                      bRenderRawSkeleton : 1;                           		// 0x155C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bShowSoftBodyTetra : 1;                           		// 0x155C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bDrawMesh : 1;                                    		// 0x155C (0x0004) [0x0000000000000000] [0x00000004] 
	struct FColor                                      BoneColor;                                        		// 0x1560 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3141 ];

		return pClassPointer;
	};

};

//UClass* UASVSkelComponent::pClassPointer = NULL;

// Class UnrealEd.BrowserManager
// 0x0024 (0x0060 - 0x003C)
class UBrowserManager : public UObject
{
public:
	TArray< struct FBrowserPaneInfo >                  BrowserPanes;                                     		// 0x003C (0x000C) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      bHasCreatedPanes : 1;                             		// 0x0048 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                LastSelectedPaneID;                               		// 0x004C (0x0004) [0x0000000000004000]              ( CPF_Config )
	struct FPointer                                    DockingContainerPtr;                              		// 0x0050 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	struct FPointer                                    FloatingWindowsArrayPtr;                          		// 0x0054 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	struct FPointer                                    BrowserMenuPtr;                                   		// 0x0058 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	class UUISceneManager*                             UISceneManager;                                   		// 0x005C (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3143 ];

		return pClassPointer;
	};

};

//UClass* UBrowserManager::pClassPointer = NULL;

// Class UnrealEd.CascadeOptions
// 0x00CC (0x0108 - 0x003C)
class UCascadeOptions : public UObject
{
public:
	unsigned long                                      bShowModuleDump : 1;                              		// 0x003C (0x0004) [0x0000000000004001] [0x00000001] ( CPF_Edit | CPF_Config )
	unsigned long                                      bUseSubMenus : 1;                                 		// 0x003C (0x0004) [0x0000000000004001] [0x00000002] ( CPF_Edit | CPF_Config )
	unsigned long                                      bUseSpaceBarReset : 1;                            		// 0x003C (0x0004) [0x0000000000004001] [0x00000004] ( CPF_Edit | CPF_Config )
	unsigned long                                      bUseSpaceBarResetInLevel : 1;                     		// 0x003C (0x0004) [0x0000000000004001] [0x00000008] ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowGrid : 1;                                    		// 0x003C (0x0004) [0x0000000000004001] [0x00000010] ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowParticleCounts : 1;                          		// 0x003C (0x0004) [0x0000000000004001] [0x00000020] ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowParticleEvents : 1;                          		// 0x003C (0x0004) [0x0000000000004001] [0x00000040] ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowParticleTimes : 1;                           		// 0x003C (0x0004) [0x0000000000004001] [0x00000080] ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowParticleDistance : 1;                        		// 0x003C (0x0004) [0x0000000000004001] [0x00000100] ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowFloor : 1;                                   		// 0x003C (0x0004) [0x0000000000004001] [0x00000200] ( CPF_Edit | CPF_Config )
	unsigned long                                      bUseSlimCascadeDraw : 1;                          		// 0x003C (0x0004) [0x0000000000004001] [0x00000400] ( CPF_Edit | CPF_Config )
	unsigned long                                      bCenterCascadeModuleText : 1;                     		// 0x003C (0x0004) [0x0000000000004001] [0x00000800] ( CPF_Edit | CPF_Config )
	struct FColor                                      BackgroundColor;                                  		// 0x0040 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      Empty_Background;                                 		// 0x0044 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      Emitter_Background;                               		// 0x0048 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      Emitter_Unselected;                               		// 0x004C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      Emitter_Selected;                                 		// 0x0050 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_General_Unselected;                   		// 0x0054 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_General_Selected;                     		// 0x0058 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_TypeData_Unselected;                  		// 0x005C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_TypeData_Selected;                    		// 0x0060 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Beam_Unselected;                      		// 0x0064 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Beam_Selected;                        		// 0x0068 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Trail_Unselected;                     		// 0x006C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Trail_Selected;                       		// 0x0070 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Spawn_Unselected;                     		// 0x0074 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Spawn_Selected;                       		// 0x0078 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Required_Unselected;                  		// 0x007C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Required_Selected;                    		// 0x0080 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Event_Unselected;                     		// 0x0084 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Event_Selected;                       		// 0x0088 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      GridColor_Hi;                                     		// 0x008C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      GridColor_Low;                                    		// 0x0090 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              GridPerspectiveSize;                              		// 0x0094 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FString                                     FloorMesh;                                        		// 0x0098 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FVector                                     FloorPosition;                                    		// 0x00A4 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FRotator                                    FloorRotation;                                    		// 0x00B0 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              FloorScale;                                       		// 0x00BC (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FVector                                     FloorScale3D;                                     		// 0x00C0 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FString                                     PostProcessChainName;                             		// 0x00CC (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	int                                                ShowPPFlags;                                      		// 0x00D8 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	int                                                SlimCascadeDrawHeight;                            		// 0x00DC (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	int                                                Cascade_MouseMoveThreshold;                       		// 0x00E0 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	TArray< struct FModuleMenuMapper >                 ModuleMenu_TypeDataToBaseModuleRejections;        		// 0x00E4 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	TArray< struct FModuleMenuMapper >                 ModuleMenu_TypeDataToSpecificModuleRejections;    		// 0x00F0 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	TArray< struct FString >                           ModuleMenu_ModuleRejections;                      		// 0x00FC (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3145 ];

		return pClassPointer;
	};

};

//UClass* UCascadeOptions::pClassPointer = NULL;

// Class UnrealEd.CascadePreviewComponent
// 0x0004 (0x0214 - 0x0210)
class UCascadePreviewComponent : public UPrimitiveComponent
{
public:
	struct FPointer                                    CascadePtr;                                       		// 0x0210 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3147 ];

		return pClassPointer;
	};

};

//UClass* UCascadePreviewComponent::pClassPointer = NULL;

// Class UnrealEd.CurveEdOptions
// 0x0078 (0x00B4 - 0x003C)
class UCurveEdOptions : public UObject
{
public:
	float                                              MinViewRange;                                     		// 0x003C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              MaxViewRange;                                     		// 0x0040 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                BackgroundColor;                                  		// 0x0044 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                LabelColor;                                       		// 0x0054 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                SelectedLabelColor;                               		// 0x0064 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                GridColor;                                        		// 0x0074 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                GridTextColor;                                    		// 0x0084 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                LabelBlockBkgColor;                               		// 0x0094 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                SelectedKeyColor;                                 		// 0x00A4 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3149 ];

		return pClassPointer;
	};

};

//UClass* UCurveEdOptions::pClassPointer = NULL;

// Class UnrealEd.CurveEdPresetBase
// 0x0000 (0x003C - 0x003C)
class UCurveEdPresetBase : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3151 ];

		return pClassPointer;
	};

	bool eventGenerateCurveData ( TArray< float >* RequiredKeyInTimes, TArray< struct FPresetGeneratedPoint >* GeneratedPoints );
	bool eventFetchRequiredKeyInTimes ( TArray< float >* RequiredKeyInTimes );
	bool eventCheckAreSettingsValid ( unsigned long bIsSaving );
	void eventFetchDisplayName ( struct FString* OutName );
	bool GenerateCurve ( TArray< float >* RequiredKeyInTimes, TArray< struct FPresetGeneratedPoint >* GeneratedPoints );
	bool GetRequiredKeyInTimes ( TArray< float >* RequiredKeyInTimes );
	bool AreSettingsValid ( unsigned long bIsSaving );
	struct FString GetDisplayName ( );
};

//UClass* UCurveEdPresetBase::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_CosWave
// 0x000C (0x0048 - 0x003C)
class UCurveEdPreset_CosWave : public UCurveEdPresetBase
{
public:
	float                                              Frequency;                                        		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Scale;                                            		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Offset;                                           		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3153 ];

		return pClassPointer;
	};

	bool GenerateCurve ( TArray< float >* RequiredKeyInTimes, TArray< struct FPresetGeneratedPoint >* GeneratedPoints );
	bool GetRequiredKeyInTimes ( TArray< float >* RequiredKeyInTimes );
	bool AreSettingsValid ( unsigned long bIsSaving );
	struct FString GetDisplayName ( );
};

//UClass* UCurveEdPreset_CosWave::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_LinearDecay
// 0x0010 (0x004C - 0x003C)
class UCurveEdPreset_LinearDecay : public UCurveEdPresetBase
{
public:
	float                                              StartDecay;                                       		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              StartValue;                                       		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              EndDecay;                                         		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              EndValue;                                         		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3155 ];

		return pClassPointer;
	};

	bool GenerateCurve ( TArray< float >* RequiredKeyInTimes, TArray< struct FPresetGeneratedPoint >* GeneratedPoints );
	bool GetRequiredKeyInTimes ( TArray< float >* RequiredKeyInTimes );
	bool AreSettingsValid ( unsigned long bIsSaving );
	struct FString GetDisplayName ( );
};

//UClass* UCurveEdPreset_LinearDecay::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_Nothing
// 0x0000 (0x003C - 0x003C)
class UCurveEdPreset_Nothing : public UCurveEdPresetBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3157 ];

		return pClassPointer;
	};

	struct FString GetDisplayName ( );
};

//UClass* UCurveEdPreset_Nothing::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_SineWave
// 0x000C (0x0048 - 0x003C)
class UCurveEdPreset_SineWave : public UCurveEdPresetBase
{
public:
	float                                              Frequency;                                        		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Scale;                                            		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Offset;                                           		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3159 ];

		return pClassPointer;
	};

	bool GenerateCurve ( TArray< float >* RequiredKeyInTimes, TArray< struct FPresetGeneratedPoint >* GeneratedPoints );
	bool GetRequiredKeyInTimes ( TArray< float >* RequiredKeyInTimes );
	bool AreSettingsValid ( unsigned long bIsSaving );
	struct FString GetDisplayName ( );
};

//UClass* UCurveEdPreset_SineWave::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_UserSet
// 0x0004 (0x0040 - 0x003C)
class UCurveEdPreset_UserSet : public UCurveEdPresetBase
{
public:
	class UCurveEdPresetCurve*                         UserCurve;                                        		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3161 ];

		return pClassPointer;
	};

	bool SaveUserSetPointFile ( );
	bool LoadUserSetPointFile ( );
	bool SetCurve ( TArray< struct FPresetGeneratedPoint > GeneratedPoints );
	bool GenerateCurve ( TArray< float >* RequiredKeyInTimes, TArray< struct FPresetGeneratedPoint >* GeneratedPoints );
	bool GetRequiredKeyInTimes ( TArray< float >* RequiredKeyInTimes );
	bool AreSettingsValid ( unsigned long bIsSaving );
	struct FString GetDisplayName ( );
};

//UClass* UCurveEdPreset_UserSet::pClassPointer = NULL;

// Class UnrealEd.PropertyInputProxy
// 0x0010 (0x004C - 0x003C)
class UPropertyInputProxy : public UObject
{
public:
	unsigned char                                      UnknownData00[ 0x10 ];                            		// 0x003C (0x0010) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3163 ];

		return pClassPointer;
	};

};

//UClass* UPropertyInputProxy::pClassPointer = NULL;

// Class UnrealEd.CustomInputProxy_Base
// 0x0004 (0x0050 - 0x004C)
class UCustomInputProxy_Base : public UPropertyInputProxy
{
public:
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x004C (0x0004) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3165 ];

		return pClassPointer;
	};

};

//UClass* UCustomInputProxy_Base::pClassPointer = NULL;

// Class UnrealEd.DefaultSizedThumbnailRenderer
// 0x0008 (0x0044 - 0x003C)
class UDefaultSizedThumbnailRenderer : public UThumbnailRenderer
{
public:
	int                                                DefaultSizeX;                                     		// 0x003C (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                DefaultSizeY;                                     		// 0x0040 (0x0004) [0x0000000000004000]              ( CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3167 ];

		return pClassPointer;
	};

};

//UClass* UDefaultSizedThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.EditorUISceneClient
// 0x0018 (0x0110 - 0x00F8)
class UEditorUISceneClient : public UUISceneClient
{
public:
	struct FPointer                                    VfTable_FCallbackEventDevice;                     		// 0x00F8 (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	class UUIScene*                                    Scene;                                            		// 0x00FC (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	class UUISceneManager*                             SceneManager;                                     		// 0x0100 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	struct FPointer                                    SceneWindow;                                      		// 0x0104 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )
	struct FPointer                                    ClientCanvasScene;                                		// 0x0108 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )
	unsigned long                                      bIsUIPrimitiveSceneInitialized : 1;               		// 0x010C (0x0004) [0x0000000000002002] [0x00000001] ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3169 ];

		return pClassPointer;
	};

	void ShowDockingStacks ( );
};

//UClass* UEditorUISceneClient::pClassPointer = NULL;

// Class UnrealEd.FaceFXStudioSkelComponent
// 0x0004 (0x155C - 0x1558)
class UFaceFXStudioSkelComponent : public USkeletalMeshComponent
{
public:
	struct FPointer                                    RenderWidgetUE3Ptr;                               		// 0x1558 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3171 ];

		return pClassPointer;
	};

};

//UClass* UFaceFXStudioSkelComponent::pClassPointer = NULL;

// Class UnrealEd.FontAttributeThumbnailRenderer
// 0x0000 (0x004C - 0x004C)
class UFontAttributeThumbnailRenderer : public UIconThumbnailRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3173 ];

		return pClassPointer;
	};

};

//UClass* UFontAttributeThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.FontColorThumbnailRenderer
// 0x0000 (0x004C - 0x004C)
class UFontColorThumbnailRenderer : public UIconThumbnailRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3175 ];

		return pClassPointer;
	};

};

//UClass* UFontColorThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.FontFaceThumbnailRenderer
// 0x0000 (0x004C - 0x004C)
class UFontFaceThumbnailRenderer : public UIconThumbnailRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3177 ];

		return pClassPointer;
	};

};

//UClass* UFontFaceThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.FontResourceThumbnailRenderer
// 0x0000 (0x004C - 0x004C)
class UFontResourceThumbnailRenderer : public UIconThumbnailRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3179 ];

		return pClassPointer;
	};

};

//UClass* UFontResourceThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.FontSetThumbnailRenderer
// 0x0000 (0x004C - 0x004C)
class UFontSetThumbnailRenderer : public UIconThumbnailRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3181 ];

		return pClassPointer;
	};

};

//UClass* UFontSetThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.TextureThumbnailRenderer
// 0x0000 (0x003C - 0x003C)
class UTextureThumbnailRenderer : public UThumbnailRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3183 ];

		return pClassPointer;
	};

};

//UClass* UTextureThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.FontThumbnailRenderer
// 0x0000 (0x003C - 0x003C)
class UFontThumbnailRenderer : public UTextureThumbnailRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3185 ];

		return pClassPointer;
	};

};

//UClass* UFontThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.StaticMeshLabelRenderer
// 0x0000 (0x003C - 0x003C)
class UStaticMeshLabelRenderer : public UThumbnailLabelRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3187 ];

		return pClassPointer;
	};

};

//UClass* UStaticMeshLabelRenderer::pClassPointer = NULL;

// Class UnrealEd.FracturedStaticMeshLabelRenderer
// 0x0000 (0x003C - 0x003C)
class UFracturedStaticMeshLabelRenderer : public UStaticMeshLabelRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3189 ];

		return pClassPointer;
	};

};

//UClass* UFracturedStaticMeshLabelRenderer::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType
// 0x001C (0x0058 - 0x003C)
class UGenericBrowserType : public UObject
{
public:
	struct FString                                     Description;                                      		// 0x003C (0x000C) [0x0000000000000000]              
	TArray< struct FGenericBrowserTypeInfo >           SupportInfo;                                      		// 0x0048 (0x000C) [0x0000000000001000]              ( CPF_Native )
	struct FColor                                      BorderColor;                                      		// 0x0054 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3191 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Custom
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Custom : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3193 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_Custom::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_All
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_All : public UGenericBrowserType_Custom
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3195 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_All::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Animation
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Animation : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3197 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_Animation::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_AnimTree
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_AnimTree : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3199 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_AnimTree::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Archetype
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Archetype : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3201 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_Archetype::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_CameraAnim
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_CameraAnim : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3203 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_CameraAnim::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_CurveEdPresetCurve
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_CurveEdPresetCurve : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3205 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_CurveEdPresetCurve::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_DecalMaterial
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_DecalMaterial : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3207 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_DecalMaterial::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_DialogueSet
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_DialogueSet : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3209 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_DialogueSet::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_DistributionFloatConstantCurve
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_DistributionFloatConstantCurve : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3211 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_DistributionFloatConstantCurve::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_EventJumpTemplate
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_EventJumpTemplate : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3213 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_EventJumpTemplate::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_FaceFXAnimSet
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_FaceFXAnimSet : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3215 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_FaceFXAnimSet::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_FaceFXAsset
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_FaceFXAsset : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3217 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_FaceFXAsset::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Font
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Font : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3219 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_Font::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_FontAttribute
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_FontAttribute : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3221 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_FontAttribute::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_FontColor
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_FontColor : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3223 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_FontColor::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_FontFace
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_FontFace : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3225 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_FontFace::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_FontResource
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_FontResource : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3227 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_FontResource::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_FontSet
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_FontSet : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3229 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_FontSet::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_StaticMesh
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_StaticMesh : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3231 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_StaticMesh::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_FracturedStaticMesh
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_FracturedStaticMesh : public UGenericBrowserType_StaticMesh
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3233 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_FracturedStaticMesh::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_ImageSet
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_ImageSet : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3235 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_ImageSet::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_LensFlare
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_LensFlare : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3237 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_LensFlare::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Material
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Material : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3239 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_Material::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_MaterialInstanceConstant
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_MaterialInstanceConstant : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3241 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_MaterialInstanceConstant::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_MaterialInstanceTimeVarying
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_MaterialInstanceTimeVarying : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3243 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_MaterialInstanceTimeVarying::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_MaterialLackingPhysMat
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_MaterialLackingPhysMat : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3245 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_MaterialLackingPhysMat::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_MorphTargetSet
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_MorphTargetSet : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3247 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_MorphTargetSet::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_MorphWeightSequence
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_MorphWeightSequence : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3249 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_MorphWeightSequence::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_ObjectNote
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_ObjectNote : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3251 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_ObjectNote::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_ParticleSet
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_ParticleSet : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3253 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_ParticleSet::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_ParticleSystem
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_ParticleSystem : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3255 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_ParticleSystem::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_PhysicalMaterial
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_PhysicalMaterial : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3257 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_PhysicalMaterial::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_PhysicsAsset
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_PhysicsAsset : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3259 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_PhysicsAsset::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_PhysXDestructible
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_PhysXDestructible : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3261 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_PhysXDestructible::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_PhysXParticleSystem
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_PhysXParticleSystem : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3263 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_PhysXParticleSystem::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_PlayerCameraAnim
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_PlayerCameraAnim : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3265 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_PlayerCameraAnim::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_PostProcess
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_PostProcess : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3267 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_PostProcess::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_PostProcessParameter
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_PostProcessParameter : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3269 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_PostProcessParameter::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Prefab
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Prefab : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3271 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_Prefab::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_ProgressEffect
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_ProgressEffect : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3273 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_ProgressEffect::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Texture
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Texture : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3275 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_Texture::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_RenderTexture
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_RenderTexture : public UGenericBrowserType_Texture
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3277 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_RenderTexture::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Sequence
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Sequence : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3279 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_Sequence::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_ShowObject
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_ShowObject : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3281 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_ShowObject::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SignalInfo
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SignalInfo : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3283 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_SignalInfo::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SkeletalMesh
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SkeletalMesh : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3285 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_SkeletalMesh::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SkeletalMeshCustomizeSet
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SkeletalMeshCustomizeSet : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3287 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_SkeletalMeshCustomizeSet::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SkeletalMeshFactorSet
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SkeletalMeshFactorSet : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3289 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_SkeletalMeshFactorSet::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Sounds
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Sounds : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3291 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_Sounds::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SoundCue
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SoundCue : public UGenericBrowserType_Sounds
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3293 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_SoundCue::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SoundMode
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SoundMode : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3295 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_SoundMode::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SoundSet
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SoundSet : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3297 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_SoundSet::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SoundWave
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SoundWave : public UGenericBrowserType_Sounds
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 3299 ];

		return pClassPointer;
	};

};

//UClass* UGenericBrowserType_SoundWave::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SpeechRecognition
